FrameworkComputer/EmbeddedController/chip/stm32/usb_dwc_registers.h
#define GC_USB_GUSBCFG_TERMSELDLPULSE_LSB        22
#define GC_USB_GUSBCFG_TERMSELDLPULSE_MASK       0x400000
#define GC_USB_GUSBCFG_TERMSELDLPULSE_SIZE       0x1
#define GC_USB_GUSBCFG_TERMSELDLPULSE_DEFAULT    0x0
#define GC_USB_GUSBCFG_TERMSELDLPULSE_OFFSET     0xc

#define GC_USB_GUSBCFG_PCCI_LSB                  23
#define GC_USB_GUSBCFG_PCCI_MASK                 (1 << 23)
#define GC_USB_GUSBCFG_PCCI_SIZE                 0x1
#define GC_USB_GUSBCFG_PCCI_DEFAULT              0x0
#define GC_USB_GUSBCFG_PCCI_OFFSET               0xc

#define GC_USB_GUSBCFG_PTCI_LSB                  24
#define GC_USB_GUSBCFG_PTCI_MASK                 (1 << 24)
#define GC_USB_GUSBCFG_PTCI_SIZE                 0x1
#define GC_USB_GUSBCFG_PTCI_DEFAULT              0x0
#define GC_USB_GUSBCFG_PTCI_OFFSET               0xc

#define GC_USB_GUSBCFG_ULPIIPD_LSB               25
#define GC_USB_GUSBCFG_ULPIIPD_MASK              (1 << 25)
#define GC_USB_GUSBCFG_ULPIIPD_SIZE              0x1
#define GC_USB_GUSBCFG_ULPIIPD_DEFAULT           0x0
#define GC_USB_GUSBCFG_ULPIIPD_OFFSET            0xc

#define GC_USB_GUSBCFG_FHMOD_LSB                 29
#define GC_USB_GUSBCFG_FHMOD_MASK                (1 << 29)
#define GC_USB_GUSBCFG_FHMOD_SIZE                0x1
#define GC_USB_GUSBCFG_FHMOD_DEFAULT             0x0
#define GC_USB_GUSBCFG_FHMOD_OFFSET              0xc

#define GC_USB_GUSBCFG_FDMOD_LSB                 30
#define GC_USB_GUSBCFG_FDMOD_MASK                (1 << 30)
#define GC_USB_GUSBCFG_FDMOD_SIZE                0x1
#define GC_USB_GUSBCFG_FDMOD_DEFAULT             0x0
#define GC_USB_GUSBCFG_FDMOD_OFFSET              0xc

#define GC_USB_GRSTCTL_CSFTRST_LSB               0x0
#define GC_USB_GRSTCTL_CSFTRST_MASK              0x1
#define GC_USB_GRSTCTL_CSFTRST_SIZE              0x1
#define GC_USB_GRSTCTL_CSFTRST_DEFAULT           0x0
#define GC_USB_GRSTCTL_CSFTRST_OFFSET            0x10
#define GC_USB_GRSTCTL_PIUFSSFTRST_LSB           0x1
#define GC_USB_GRSTCTL_PIUFSSFTRST_MASK          0x2
#define GC_USB_GRSTCTL_PIUFSSFTRST_SIZE          0x1
#define GC_USB_GRSTCTL_PIUFSSFTRST_DEFAULT       0x0
#define GC_USB_GRSTCTL_PIUFSSFTRST_OFFSET        0x10
#define GC_USB_GRSTCTL_RXFFLSH_LSB               0x4
#define GC_USB_GRSTCTL_RXFFLSH_MASK              0x10
#define GC_USB_GRSTCTL_RXFFLSH_SIZE              0x1
#define GC_USB_GRSTCTL_RXFFLSH_DEFAULT           0x0
#define GC_USB_GRSTCTL_RXFFLSH_OFFSET            0x10
#define GC_USB_GRSTCTL_TXFFLSH_LSB               0x5
#define GC_USB_GRSTCTL_TXFFLSH_MASK              0x20
#define GC_USB_GRSTCTL_TXFFLSH_SIZE              0x1
#define GC_USB_GRSTCTL_TXFFLSH_DEFAULT           0x0
#define GC_USB_GRSTCTL_TXFFLSH_OFFSET            0x10
#define GC_USB_GRSTCTL_TXFNUM_LSB                0x6
#define GC_USB_GRSTCTL_TXFNUM_MASK               0x7c0
#define GC_USB_GRSTCTL_TXFNUM_SIZE               0x5
#define GC_USB_GRSTCTL_TXFNUM_DEFAULT            0x0
#define GC_USB_GRSTCTL_TXFNUM_OFFSET             0x10
#define GC_USB_GRSTCTL_DMAREQ_LSB                0x1e
#define GC_USB_GRSTCTL_DMAREQ_MASK               0x40000000
#define GC_USB_GRSTCTL_DMAREQ_SIZE               0x1
#define GC_USB_GRSTCTL_DMAREQ_DEFAULT            0x0
#define GC_USB_GRSTCTL_DMAREQ_OFFSET             0x10
#define GC_USB_GRSTCTL_AHBIDLE_LSB               0x1f
#define GC_USB_GRSTCTL_AHBIDLE_MASK              0x80000000
#define GC_USB_GRSTCTL_AHBIDLE_SIZE              0x1
#define GC_USB_GRSTCTL_AHBIDLE_DEFAULT           0x0
#define GC_USB_GRSTCTL_AHBIDLE_OFFSET            0x10
#define GC_USB_GINTSTS_CURMOD_LSB                0x0
#define GC_USB_GINTSTS_CURMOD_MASK               0x1
#define GC_USB_GINTSTS_CURMOD_SIZE               0x1
#define GC_USB_GINTSTS_CURMOD_DEFAULT            0x0
#define GC_USB_GINTSTS_CURMOD_OFFSET             0x14
#define GC_USB_GINTSTS_MODEMIS_LSB               0x1
#define GC_USB_GINTSTS_MODEMIS_MASK              0x2
#define GC_USB_GINTSTS_MODEMIS_SIZE              0x1
#define GC_USB_GINTSTS_MODEMIS_DEFAULT           0x0
#define GC_USB_GINTSTS_MODEMIS_OFFSET            0x14
#define GC_USB_GINTSTS_OTGINT_LSB                0x2
#define GC_USB_GINTSTS_OTGINT_MASK               0x4
#define GC_USB_GINTSTS_OTGINT_SIZE               0x1
#define GC_USB_GINTSTS_OTGINT_DEFAULT            0x0
#define GC_USB_GINTSTS_OTGINT_OFFSET             0x14
#define GC_USB_GINTSTS_SOF_LSB                   0x3
#define GC_USB_GINTSTS_SOF_MASK                  0x8
#define GC_USB_GINTSTS_SOF_SIZE                  0x1
#define GC_USB_GINTSTS_SOF_DEFAULT               0x0
#define GC_USB_GINTSTS_SOF_OFFSET                0x14
#define GC_USB_GINTSTS_RXFLVL_LSB                0x4
#define GC_USB_GINTSTS_RXFLVL_MASK               0x10
#define GC_USB_GINTSTS_RXFLVL_SIZE               0x1
#define GC_USB_GINTSTS_RXFLVL_DEFAULT            0x0
#define GC_USB_GINTSTS_RXFLVL_OFFSET             0x14
#define GC_USB_GINTSTS_GINNAKEFF_LSB             0x6
#define GC_USB_GINTSTS_GINNAKEFF_MASK            0x40
#define GC_USB_GINTSTS_GINNAKEFF_SIZE            0x1
#define GC_USB_GINTSTS_GINNAKEFF_DEFAULT         0x0
#define GC_USB_GINTSTS_GINNAKEFF_OFFSET          0x14
#define GC_USB_GINTSTS_GOUTNAKEFF_LSB            0x7
#define GC_USB_GINTSTS_GOUTNAKEFF_MASK           0x80
#define GC_USB_GINTSTS_GOUTNAKEFF_SIZE           0x1
#define GC_USB_GINTSTS_GOUTNAKEFF_DEFAULT        0x0
#define GC_USB_GINTSTS_GOUTNAKEFF_OFFSET         0x14
#define GC_USB_GINTSTS_ERLYSUSP_LSB              0xa
#define GC_USB_GINTSTS_ERLYSUSP_MASK             0x400
#define GC_USB_GINTSTS_ERLYSUSP_SIZE             0x1
#define GC_USB_GINTSTS_ERLYSUSP_DEFAULT          0x0
#define GC_USB_GINTSTS_ERLYSUSP_OFFSET           0x14
#define GC_USB_GINTSTS_USBSUSP_LSB               0xb
#define GC_USB_GINTSTS_USBSUSP_MASK              0x800
#define GC_USB_GINTSTS_USBSUSP_SIZE              0x1
#define GC_USB_GINTSTS_USBSUSP_DEFAULT           0x0
#define GC_USB_GINTSTS_USBSUSP_OFFSET            0x14
#define GC_USB_GINTSTS_USBRST_LSB                0xc
#define GC_USB_GINTSTS_USBRST_MASK               0x1000
#define GC_USB_GINTSTS_USBRST_SIZE               0x1
#define GC_USB_GINTSTS_USBRST_DEFAULT            0x0
#define GC_USB_GINTSTS_USBRST_OFFSET             0x14
#define GC_USB_GINTSTS_ENUMDONE_LSB              0xd
#define GC_USB_GINTSTS_ENUMDONE_MASK             0x2000
#define GC_USB_GINTSTS_ENUMDONE_SIZE             0x1
#define GC_USB_GINTSTS_ENUMDONE_DEFAULT          0x0
#define GC_USB_GINTSTS_ENUMDONE_OFFSET           0x14
#define GC_USB_GINTSTS_ISOOUTDROP_LSB            0xe
#define GC_USB_GINTSTS_ISOOUTDROP_MASK           0x4000
#define GC_USB_GINTSTS_ISOOUTDROP_SIZE           0x1
#define GC_USB_GINTSTS_ISOOUTDROP_DEFAULT        0x0
#define GC_USB_GINTSTS_ISOOUTDROP_OFFSET         0x14
#define GC_USB_GINTSTS_EOPF_LSB                  0xf
#define GC_USB_GINTSTS_EOPF_MASK                 0x8000
#define GC_USB_GINTSTS_EOPF_SIZE                 0x1
#define GC_USB_GINTSTS_EOPF_DEFAULT              0x0
#define GC_USB_GINTSTS_EOPF_OFFSET               0x14
#define GC_USB_GINTSTS_EPMIS_LSB                 0x11
#define GC_USB_GINTSTS_EPMIS_MASK                0x20000
#define GC_USB_GINTSTS_EPMIS_SIZE                0x1
#define GC_USB_GINTSTS_EPMIS_DEFAULT             0x0
#define GC_USB_GINTSTS_EPMIS_OFFSET              0x14
#define GC_USB_GINTSTS_IEPINT_LSB                0x12
#define GC_USB_GINTSTS_IEPINT_MASK               0x40000
#define GC_USB_GINTSTS_IEPINT_SIZE               0x1
#define GC_USB_GINTSTS_IEPINT_DEFAULT            0x0
#define GC_USB_GINTSTS_IEPINT_OFFSET             0x14
#define GC_USB_GINTSTS_OEPINT_LSB                0x13
#define GC_USB_GINTSTS_OEPINT_MASK               0x80000
#define GC_USB_GINTSTS_OEPINT_SIZE               0x1
#define GC_USB_GINTSTS_OEPINT_DEFAULT            0x0
#define GC_USB_GINTSTS_OEPINT_OFFSET             0x14
#define GC_USB_GINTSTS_INCOMPISOIN_LSB           0x14
#define GC_USB_GINTSTS_INCOMPISOIN_MASK          0x100000
#define GC_USB_GINTSTS_INCOMPISOIN_SIZE          0x1
#define GC_USB_GINTSTS_INCOMPISOIN_DEFAULT       0x0
#define GC_USB_GINTSTS_INCOMPISOIN_OFFSET        0x14
#define GC_USB_GINTSTS_INCOMPLP_LSB              0x15
#define GC_USB_GINTSTS_INCOMPLP_MASK             0x200000
#define GC_USB_GINTSTS_INCOMPLP_SIZE             0x1
#define GC_USB_GINTSTS_INCOMPLP_DEFAULT          0x0
#define GC_USB_GINTSTS_INCOMPLP_OFFSET           0x14
#define GC_USB_GINTSTS_FETSUSP_LSB               0x16
#define GC_USB_GINTSTS_FETSUSP_MASK              0x400000
#define GC_USB_GINTSTS_FETSUSP_SIZE              0x1
#define GC_USB_GINTSTS_FETSUSP_DEFAULT           0x0
#define GC_USB_GINTSTS_FETSUSP_OFFSET            0x14
#define GC_USB_GINTSTS_RESETDET_LSB              0x17
#define GC_USB_GINTSTS_RESETDET_MASK             0x800000
#define GC_USB_GINTSTS_RESETDET_SIZE             0x1
#define GC_USB_GINTSTS_RESETDET_DEFAULT          0x0
#define GC_USB_GINTSTS_RESETDET_OFFSET           0x14
#define GC_USB_GINTSTS_CONIDSTSCHNG_LSB          0x1c
#define GC_USB_GINTSTS_CONIDSTSCHNG_MASK         0x10000000
#define GC_USB_GINTSTS_CONIDSTSCHNG_SIZE         0x1
#define GC_USB_GINTSTS_CONIDSTSCHNG_DEFAULT      0x0
#define GC_USB_GINTSTS_CONIDSTSCHNG_OFFSET       0x14
#define GC_USB_GINTSTS_SESSREQINT_LSB            0x1e
#define GC_USB_GINTSTS_SESSREQINT_MASK           0x40000000
#define GC_USB_GINTSTS_SESSREQINT_SIZE           0x1
#define GC_USB_GINTSTS_SESSREQINT_DEFAULT        0x0
#define GC_USB_GINTSTS_SESSREQINT_OFFSET         0x14
#define GC_USB_GINTSTS_WKUPINT_LSB               0x1f
#define GC_USB_GINTSTS_WKUPINT_MASK              0x80000000
#define GC_USB_GINTSTS_WKUPINT_SIZE              0x1
#define GC_USB_GINTSTS_WKUPINT_DEFAULT           0x0
#define GC_USB_GINTSTS_WKUPINT_OFFSET            0x14
#define GC_USB_GINTMSK_MODEMISMSK_LSB            0x1
#define GC_USB_GINTMSK_MODEMISMSK_MASK           0x2
#define GC_USB_GINTMSK_MODEMISMSK_SIZE           0x1
#define GC_USB_GINTMSK_MODEMISMSK_DEFAULT        0x0
#define GC_USB_GINTMSK_MODEMISMSK_OFFSET         0x18
#define GC_USB_GINTMSK_OTGINTMSK_LSB             0x2
#define GC_USB_GINTMSK_OTGINTMSK_MASK            0x4
#define GC_USB_GINTMSK_OTGINTMSK_SIZE            0x1
#define GC_USB_GINTMSK_OTGINTMSK_DEFAULT         0x0
#define GC_USB_GINTMSK_OTGINTMSK_OFFSET          0x18
#define GC_USB_GINTMSK_SOFMSK_LSB                0x3
#define GC_USB_GINTMSK_SOFMSK_MASK               0x8
#define GC_USB_GINTMSK_SOFMSK_SIZE               0x1
#define GC_USB_GINTMSK_SOFMSK_DEFAULT            0x0
#define GC_USB_GINTMSK_SOFMSK_OFFSET             0x18
#define GC_USB_GINTMSK_RXFLVLMSK_LSB             0x4
#define GC_USB_GINTMSK_RXFLVLMSK_MASK            0x10
#define GC_USB_GINTMSK_RXFLVLMSK_SIZE            0x1
#define GC_USB_GINTMSK_RXFLVLMSK_DEFAULT         0x0
#define GC_USB_GINTMSK_RXFLVLMSK_OFFSET          0x18
#define GC_USB_GINTMSK_UNKNOWN5_LSB              0x5
#define GC_USB_GINTMSK_UNKNOWN5_MASK             0x20
#define GC_USB_GINTMSK_UNKNOWN5_SIZE             0x1
#define GC_USB_GINTMSK_UNKNOWN5_DEFAULT          0x0
#define GC_USB_GINTMSK_UNKNOWN5_OFFSET           0x18
#define GC_USB_GINTMSK_GINNAKEFFMSK_LSB          0x6
#define GC_USB_GINTMSK_GINNAKEFFMSK_MASK         0x40
#define GC_USB_GINTMSK_GINNAKEFFMSK_SIZE         0x1
#define GC_USB_GINTMSK_GINNAKEFFMSK_DEFAULT      0x0
#define GC_USB_GINTMSK_GINNAKEFFMSK_OFFSET       0x18
#define GC_USB_GINTMSK_GOUTNAKEFFMSK_LSB         0x7
#define GC_USB_GINTMSK_GOUTNAKEFFMSK_MASK        0x80
#define GC_USB_GINTMSK_GOUTNAKEFFMSK_SIZE        0x1
#define GC_USB_GINTMSK_GOUTNAKEFFMSK_DEFAULT     0x0
#define GC_USB_GINTMSK_GOUTNAKEFFMSK_OFFSET      0x18
#define GC_USB_GINTMSK_ERLYSUSPMSK_LSB           0xa
#define GC_USB_GINTMSK_ERLYSUSPMSK_MASK          0x400
#define GC_USB_GINTMSK_ERLYSUSPMSK_SIZE          0x1
#define GC_USB_GINTMSK_ERLYSUSPMSK_DEFAULT       0x0
#define GC_USB_GINTMSK_ERLYSUSPMSK_OFFSET        0x18
#define GC_USB_GINTMSK_USBSUSPMSK_LSB            0xb
#define GC_USB_GINTMSK_USBSUSPMSK_MASK           0x800
#define GC_USB_GINTMSK_USBSUSPMSK_SIZE           0x1
#define GC_USB_GINTMSK_USBSUSPMSK_DEFAULT        0x0
#define GC_USB_GINTMSK_USBSUSPMSK_OFFSET         0x18
#define GC_USB_GINTMSK_USBRSTMSK_LSB             0xc
#define GC_USB_GINTMSK_USBRSTMSK_MASK            0x1000
#define GC_USB_GINTMSK_USBRSTMSK_SIZE            0x1
#define GC_USB_GINTMSK_USBRSTMSK_DEFAULT         0x0
#define GC_USB_GINTMSK_USBRSTMSK_OFFSET          0x18
#define GC_USB_GINTMSK_ENUMDONEMSK_LSB           0xd
#define GC_USB_GINTMSK_ENUMDONEMSK_MASK          0x2000
#define GC_USB_GINTMSK_ENUMDONEMSK_SIZE          0x1
#define GC_USB_GINTMSK_ENUMDONEMSK_DEFAULT       0x0
#define GC_USB_GINTMSK_ENUMDONEMSK_OFFSET        0x18
#define GC_USB_GINTMSK_ISOOUTDROPMSK_LSB         0xe
#define GC_USB_GINTMSK_ISOOUTDROPMSK_MASK        0x4000
#define GC_USB_GINTMSK_ISOOUTDROPMSK_SIZE        0x1
#define GC_USB_GINTMSK_ISOOUTDROPMSK_DEFAULT     0x0
#define GC_USB_GINTMSK_ISOOUTDROPMSK_OFFSET      0x18
#define GC_USB_GINTMSK_EOPFMSK_LSB               0xf
#define GC_USB_GINTMSK_EOPFMSK_MASK              0x8000
#define GC_USB_GINTMSK_EOPFMSK_SIZE              0x1
#define GC_USB_GINTMSK_EOPFMSK_DEFAULT           0x0
#define GC_USB_GINTMSK_EOPFMSK_OFFSET            0x18
#define GC_USB_GINTMSK_UNKNOWN16_LSB             0x10
#define GC_USB_GINTMSK_UNKNOWN16_MASK            0x10000
#define GC_USB_GINTMSK_UNKNOWN16_SIZE            0x1
#define GC_USB_GINTMSK_UNKNOWN16_DEFAULT         0x0
#define GC_USB_GINTMSK_UNKNOWN16_OFFSET          0x18
#define GC_USB_GINTMSK_EPMISMSK_LSB              0x11
#define GC_USB_GINTMSK_EPMISMSK_MASK             0x20000
#define GC_USB_GINTMSK_EPMISMSK_SIZE             0x1
#define GC_USB_GINTMSK_EPMISMSK_DEFAULT          0x0
#define GC_USB_GINTMSK_EPMISMSK_OFFSET           0x18
#define GC_USB_GINTMSK_IEPINTMSK_LSB             0x12
#define GC_USB_GINTMSK_IEPINTMSK_MASK            0x40000
#define GC_USB_GINTMSK_IEPINTMSK_SIZE            0x1
#define GC_USB_GINTMSK_IEPINTMSK_DEFAULT         0x0
#define GC_USB_GINTMSK_IEPINTMSK_OFFSET          0x18
#define GC_USB_GINTMSK_OEPINTMSK_LSB             0x13
#define GC_USB_GINTMSK_OEPINTMSK_MASK            0x80000
#define GC_USB_GINTMSK_OEPINTMSK_SIZE            0x1
#define GC_USB_GINTMSK_OEPINTMSK_DEFAULT         0x0
#define GC_USB_GINTMSK_OEPINTMSK_OFFSET          0x18
#define GC_USB_GINTMSK_INCOMPISOINMSK_LSB        0x14
#define GC_USB_GINTMSK_INCOMPISOINMSK_MASK       0x100000
#define GC_USB_GINTMSK_INCOMPISOINMSK_SIZE       0x1
#define GC_USB_GINTMSK_INCOMPISOINMSK_DEFAULT    0x0
#define GC_USB_GINTMSK_INCOMPISOINMSK_OFFSET     0x18
#define GC_USB_GINTMSK_INCOMPLISOOUTMSK_LSB      0x15
#define GC_USB_GINTMSK_INCOMPLISOOUTMSK_MASK     0x200000
#define GC_USB_GINTMSK_INCOMPLISOOUTMSK_SIZE     0x1
#define GC_USB_GINTMSK_INCOMPLISOOUTMSK_DEFAULT  0x0
#define GC_USB_GINTMSK_INCOMPLISOOUTMSK_OFFSET   0x18
#define GC_USB_GINTMSK_FETSUSPMSK_LSB            0x16
#define GC_USB_GINTMSK_FETSUSPMSK_MASK           0x400000
#define GC_USB_GINTMSK_FETSUSPMSK_SIZE           0x1
#define GC_USB_GINTMSK_FETSUSPMSK_DEFAULT        0x0
#define GC_USB_GINTMSK_FETSUSPMSK_OFFSET         0x18
#define GC_USB_GINTMSK_RESETDETMSK_LSB           0x17
#define GC_USB_GINTMSK_RESETDETMSK_MASK          0x800000
#define GC_USB_GINTMSK_RESETDETMSK_SIZE          0x1
#define GC_USB_GINTMSK_RESETDETMSK_DEFAULT       0x0
#define GC_USB_GINTMSK_RESETDETMSK_OFFSET        0x18
#define GC_USB_GINTMSK_CONIDSTSCHNGMSK_LSB       0x1c
#define GC_USB_GINTMSK_CONIDSTSCHNGMSK_MASK      0x10000000
#define GC_USB_GINTMSK_CONIDSTSCHNGMSK_SIZE      0x1
#define GC_USB_GINTMSK_CONIDSTSCHNGMSK_DEFAULT   0x0
#define GC_USB_GINTMSK_CONIDSTSCHNGMSK_OFFSET    0x18
#define GC_USB_GINTMSK_DISCONNINTMSK_LSB         0x1d
#define GC_USB_GINTMSK_DISCONNINTMSK_MASK        0x20000000
#define GC_USB_GINTMSK_DISCONNINTMSK_SIZE        0x1
#define GC_USB_GINTMSK_DISCONNINTMSK_DEFAULT     0x0
#define GC_USB_GINTMSK_DISCONNINTMSK_OFFSET      0x18
#define GC_USB_GINTMSK_SESSREQINTMSK_LSB         0x1e
#define GC_USB_GINTMSK_SESSREQINTMSK_MASK        0x40000000
#define GC_USB_GINTMSK_SESSREQINTMSK_SIZE        0x1
#define GC_USB_GINTMSK_SESSREQINTMSK_DEFAULT     0x0
#define GC_USB_GINTMSK_SESSREQINTMSK_OFFSET      0x18
#define GC_USB_GINTMSK_WKUPINTMSK_LSB            0x1f
#define GC_USB_GINTMSK_WKUPINTMSK_MASK           0x80000000
#define GC_USB_GINTMSK_WKUPINTMSK_SIZE           0x1
#define GC_USB_GINTMSK_WKUPINTMSK_DEFAULT        0x0
#define GC_USB_GINTMSK_WKUPINTMSK_OFFSET         0x18
#define GC_USB_GRXSTSR_CHNUM_LSB                 0x0
#define GC_USB_GRXSTSR_CHNUM_MASK                0xf
#define GC_USB_GRXSTSR_CHNUM_SIZE                0x4
#define GC_USB_GRXSTSR_CHNUM_DEFAULT             0x0
#define GC_USB_GRXSTSR_CHNUM_OFFSET              0x1c
#define GC_USB_GRXSTSR_BCNT_LSB                  0x4
#define GC_USB_GRXSTSR_BCNT_MASK                 0x7ff0
#define GC_USB_GRXSTSR_BCNT_SIZE                 0xb
#define GC_USB_GRXSTSR_BCNT_DEFAULT              0x0
#define GC_USB_GRXSTSR_BCNT_OFFSET               0x1c
#define GC_USB_GRXSTSR_DPID_LSB                  0xf
#define GC_USB_GRXSTSR_DPID_MASK                 0x18000
#define GC_USB_GRXSTSR_DPID_SIZE                 0x2
#define GC_USB_GRXSTSR_DPID_DEFAULT              0x0
#define GC_USB_GRXSTSR_DPID_OFFSET               0x1c
#define GC_USB_GRXSTSR_PKTSTS_LSB                0x11
#define GC_USB_GRXSTSR_PKTSTS_MASK               0x1e0000
#define GC_USB_GRXSTSR_PKTSTS_SIZE               0x4
#define GC_USB_GRXSTSR_PKTSTS_DEFAULT            0x0
#define GC_USB_GRXSTSR_PKTSTS_OFFSET             0x1c
#define GC_USB_GRXSTSR_FN_LSB                    0x15
#define GC_USB_GRXSTSR_FN_MASK                   0x1e00000
#define GC_USB_GRXSTSR_FN_SIZE                   0x4
#define GC_USB_GRXSTSR_FN_DEFAULT                0x0
#define GC_USB_GRXSTSR_FN_OFFSET                 0x1c
#define GC_USB_GRXSTSP_CHNUM_LSB                 0x0
#define GC_USB_GRXSTSP_CHNUM_MASK                0xf
#define GC_USB_GRXSTSP_CHNUM_SIZE                0x4
#define GC_USB_GRXSTSP_CHNUM_DEFAULT             0x0
#define GC_USB_GRXSTSP_CHNUM_OFFSET              0x20
#define GC_USB_GRXSTSP_BCNT_LSB                  0x4
#define GC_USB_GRXSTSP_BCNT_MASK                 0x7ff0
#define GC_USB_GRXSTSP_BCNT_SIZE                 0xb
#define GC_USB_GRXSTSP_BCNT_DEFAULT              0x0
#define GC_USB_GRXSTSP_BCNT_OFFSET               0x20
#define GC_USB_GRXSTSP_DPID_LSB                  0xf
#define GC_USB_GRXSTSP_DPID_MASK                 0x18000
#define GC_USB_GRXSTSP_DPID_SIZE                 0x2
#define GC_USB_GRXSTSP_DPID_DEFAULT              0x0
#define GC_USB_GRXSTSP_DPID_OFFSET               0x20
#define GC_USB_GRXSTSP_PKTSTS_LSB                0x11
#define GC_USB_GRXSTSP_PKTSTS_MASK               0x1e0000
#define GC_USB_GRXSTSP_PKTSTS_SIZE               0x4
#define GC_USB_GRXSTSP_PKTSTS_DEFAULT            0x0
#define GC_USB_GRXSTSP_PKTSTS_OFFSET             0x20
#define GC_USB_GRXSTSP_FN_LSB                    0x15
#define GC_USB_GRXSTSP_FN_MASK                   0x1e00000
#define GC_USB_GRXSTSP_FN_SIZE                   0x4
#define GC_USB_GRXSTSP_FN_DEFAULT                0x0
#define GC_USB_GRXSTSP_FN_OFFSET                 0x20
#define GC_USB_GRXFSIZ_RXFDEP_LSB                0x0
#define GC_USB_GRXFSIZ_RXFDEP_MASK               0x7ff
#define GC_USB_GRXFSIZ_RXFDEP_SIZE               0xb
#define GC_USB_GRXFSIZ_RXFDEP_DEFAULT            0x0
#define GC_USB_GRXFSIZ_RXFDEP_OFFSET             0x24
#define GC_USB_GNPTXFSIZ_INEPTXF0STADDR_LSB      0x0
#define GC_USB_GNPTXFSIZ_INEPTXF0STADDR_MASK     0xffff
#define GC_USB_GNPTXFSIZ_INEPTXF0STADDR_SIZE     0x10
#define GC_USB_GNPTXFSIZ_INEPTXF0STADDR_DEFAULT  0x0
#define GC_USB_GNPTXFSIZ_INEPTXF0STADDR_OFFSET   0x28
#define GC_USB_GNPTXFSIZ_INEPTXF0DEP_LSB         0x10
#define GC_USB_GNPTXFSIZ_INEPTXF0DEP_MASK        0xffff0000
#define GC_USB_GNPTXFSIZ_INEPTXF0DEP_SIZE        0x10
#define GC_USB_GNPTXFSIZ_INEPTXF0DEP_DEFAULT     0x0
#define GC_USB_GNPTXFSIZ_INEPTXF0DEP_OFFSET      0x28

