FrameworkComputer/EmbeddedController/chip/stm32/usb_dwc_registers.h
#define GC_USB_DCTL_RMTWKUPSIG_DEFAULT           0x0
#define GC_USB_DCTL_RMTWKUPSIG_OFFSET            0x804
#define GC_USB_DCTL_SFTDISCON_LSB                0x1
#define GC_USB_DCTL_SFTDISCON_MASK               0x2
#define GC_USB_DCTL_SFTDISCON_SIZE               0x1
#define GC_USB_DCTL_SFTDISCON_DEFAULT            0x0
#define GC_USB_DCTL_SFTDISCON_OFFSET             0x804
#define GC_USB_DCTL_GNPINNAKSTS_LSB              0x2
#define GC_USB_DCTL_GNPINNAKSTS_MASK             0x4
#define GC_USB_DCTL_GNPINNAKSTS_SIZE             0x1
#define GC_USB_DCTL_GNPINNAKSTS_DEFAULT          0x0
#define GC_USB_DCTL_GNPINNAKSTS_OFFSET           0x804
#define GC_USB_DCTL_GOUTNAKSTS_LSB               0x3
#define GC_USB_DCTL_GOUTNAKSTS_MASK              0x8
#define GC_USB_DCTL_GOUTNAKSTS_SIZE              0x1
#define GC_USB_DCTL_GOUTNAKSTS_DEFAULT           0x0
#define GC_USB_DCTL_GOUTNAKSTS_OFFSET            0x804
#define GC_USB_DCTL_TSTCTL_LSB                   0x4
#define GC_USB_DCTL_TSTCTL_MASK                  0x70
#define GC_USB_DCTL_TSTCTL_SIZE                  0x3
#define GC_USB_DCTL_TSTCTL_DEFAULT               0x0
#define GC_USB_DCTL_TSTCTL_OFFSET                0x804
#define GC_USB_DCTL_SGNPINNAK_LSB                0x7
#define GC_USB_DCTL_SGNPINNAK_MASK               0x80
#define GC_USB_DCTL_SGNPINNAK_SIZE               0x1
#define GC_USB_DCTL_SGNPINNAK_DEFAULT            0x0
#define GC_USB_DCTL_SGNPINNAK_OFFSET             0x804
#define GC_USB_DCTL_CGNPINNAK_LSB                0x8
#define GC_USB_DCTL_CGNPINNAK_MASK               0x100
#define GC_USB_DCTL_CGNPINNAK_SIZE               0x1
#define GC_USB_DCTL_CGNPINNAK_DEFAULT            0x0
#define GC_USB_DCTL_CGNPINNAK_OFFSET             0x804
#define GC_USB_DCTL_SGOUTNAK_LSB                 0x9
#define GC_USB_DCTL_SGOUTNAK_MASK                0x200
#define GC_USB_DCTL_SGOUTNAK_SIZE                0x1
#define GC_USB_DCTL_SGOUTNAK_DEFAULT             0x0
#define GC_USB_DCTL_SGOUTNAK_OFFSET              0x804
#define GC_USB_DCTL_CGOUTNAK_LSB                 0xa
#define GC_USB_DCTL_CGOUTNAK_MASK                0x400
#define GC_USB_DCTL_CGOUTNAK_SIZE                0x1
#define GC_USB_DCTL_CGOUTNAK_DEFAULT             0x0
#define GC_USB_DCTL_CGOUTNAK_OFFSET              0x804
#define GC_USB_DCTL_PWRONPRGDONE_LSB             0xb
#define GC_USB_DCTL_PWRONPRGDONE_MASK            0x800
#define GC_USB_DCTL_PWRONPRGDONE_SIZE            0x1
#define GC_USB_DCTL_PWRONPRGDONE_DEFAULT         0x0
#define GC_USB_DCTL_PWRONPRGDONE_OFFSET          0x804
#define GC_USB_DCTL_GMC_LSB                      0xd
#define GC_USB_DCTL_GMC_MASK                     0x6000
#define GC_USB_DCTL_GMC_SIZE                     0x2
#define GC_USB_DCTL_GMC_DEFAULT                  0x0
#define GC_USB_DCTL_GMC_OFFSET                   0x804
#define GC_USB_DCTL_IGNRFRMNUM_LSB               0xf
#define GC_USB_DCTL_IGNRFRMNUM_MASK              0x8000
#define GC_USB_DCTL_IGNRFRMNUM_SIZE              0x1
#define GC_USB_DCTL_IGNRFRMNUM_DEFAULT           0x0
#define GC_USB_DCTL_IGNRFRMNUM_OFFSET            0x804
#define GC_USB_DCTL_NAKONBBLE_LSB                0x10
#define GC_USB_DCTL_NAKONBBLE_MASK               0x10000
#define GC_USB_DCTL_NAKONBBLE_SIZE               0x1
#define GC_USB_DCTL_NAKONBBLE_DEFAULT            0x0
#define GC_USB_DCTL_NAKONBBLE_OFFSET             0x804
#define GC_USB_DCTL_ENCONTONBNA_LSB              0x11
#define GC_USB_DCTL_ENCONTONBNA_MASK             0x20000
#define GC_USB_DCTL_ENCONTONBNA_SIZE             0x1
#define GC_USB_DCTL_ENCONTONBNA_DEFAULT          0x0
#define GC_USB_DCTL_ENCONTONBNA_OFFSET           0x804
#define GC_USB_DSTS_SUSPSTS_LSB                  0x0
#define GC_USB_DSTS_SUSPSTS_MASK                 0x1
#define GC_USB_DSTS_SUSPSTS_SIZE                 0x1
#define GC_USB_DSTS_SUSPSTS_DEFAULT              0x0
#define GC_USB_DSTS_SUSPSTS_OFFSET               0x808
#define GC_USB_DSTS_ENUMSPD_LSB                  0x1
#define GC_USB_DSTS_ENUMSPD_MASK                 0x6
#define GC_USB_DSTS_ENUMSPD_SIZE                 0x2
#define GC_USB_DSTS_ENUMSPD_DEFAULT              0x0
#define GC_USB_DSTS_ENUMSPD_OFFSET               0x808
#define GC_USB_DSTS_ERRTICERR_LSB                0x3
#define GC_USB_DSTS_ERRTICERR_MASK               0x8
#define GC_USB_DSTS_ERRTICERR_SIZE               0x1
#define GC_USB_DSTS_ERRTICERR_DEFAULT            0x0
#define GC_USB_DSTS_ERRTICERR_OFFSET             0x808
#define GC_USB_DSTS_SOFFN_LSB                    0x8
#define GC_USB_DSTS_SOFFN_MASK                   0x3fff00
#define GC_USB_DSTS_SOFFN_SIZE                   0xe
#define GC_USB_DSTS_SOFFN_DEFAULT                0x0
#define GC_USB_DSTS_SOFFN_OFFSET                 0x808
#define GC_USB_DSTS_DEVLNSTS_LSB                 0x16
#define GC_USB_DSTS_DEVLNSTS_MASK                0xc00000
#define GC_USB_DSTS_DEVLNSTS_SIZE                0x2
#define GC_USB_DSTS_DEVLNSTS_DEFAULT             0x0
#define GC_USB_DSTS_DEVLNSTS_OFFSET              0x808
#define GC_USB_DIEPMSK_XFERCOMPLMSK_LSB          0x0
#define GC_USB_DIEPMSK_XFERCOMPLMSK_MASK         0x1
#define GC_USB_DIEPMSK_XFERCOMPLMSK_SIZE         0x1
#define GC_USB_DIEPMSK_XFERCOMPLMSK_DEFAULT      0x0
#define GC_USB_DIEPMSK_XFERCOMPLMSK_OFFSET       0x810
#define GC_USB_DIEPMSK_EPDISBLDMSK_LSB           0x1
#define GC_USB_DIEPMSK_EPDISBLDMSK_MASK          0x2
#define GC_USB_DIEPMSK_EPDISBLDMSK_SIZE          0x1
#define GC_USB_DIEPMSK_EPDISBLDMSK_DEFAULT       0x0
#define GC_USB_DIEPMSK_EPDISBLDMSK_OFFSET        0x810
#define GC_USB_DIEPMSK_AHBERRMSK_LSB             0x2
#define GC_USB_DIEPMSK_AHBERRMSK_MASK            0x4
#define GC_USB_DIEPMSK_AHBERRMSK_SIZE            0x1
#define GC_USB_DIEPMSK_AHBERRMSK_DEFAULT         0x0
#define GC_USB_DIEPMSK_AHBERRMSK_OFFSET          0x810
#define GC_USB_DIEPMSK_TIMEOUTMSK_LSB            0x3
#define GC_USB_DIEPMSK_TIMEOUTMSK_MASK           0x8
#define GC_USB_DIEPMSK_TIMEOUTMSK_SIZE           0x1
#define GC_USB_DIEPMSK_TIMEOUTMSK_DEFAULT        0x0
#define GC_USB_DIEPMSK_TIMEOUTMSK_OFFSET         0x810
#define GC_USB_DIEPMSK_INTKNTXFEMPMSK_LSB        0x4
#define GC_USB_DIEPMSK_INTKNTXFEMPMSK_MASK       0x10
#define GC_USB_DIEPMSK_INTKNTXFEMPMSK_SIZE       0x1
#define GC_USB_DIEPMSK_INTKNTXFEMPMSK_DEFAULT    0x0
#define GC_USB_DIEPMSK_INTKNTXFEMPMSK_OFFSET     0x810
#define GC_USB_DIEPMSK_INTKNEPMISMSK_LSB         0x5
#define GC_USB_DIEPMSK_INTKNEPMISMSK_MASK        0x20
#define GC_USB_DIEPMSK_INTKNEPMISMSK_SIZE        0x1
#define GC_USB_DIEPMSK_INTKNEPMISMSK_DEFAULT     0x0
#define GC_USB_DIEPMSK_INTKNEPMISMSK_OFFSET      0x810
#define GC_USB_DIEPMSK_INEPNAKEFFMSK_LSB         0x6
#define GC_USB_DIEPMSK_INEPNAKEFFMSK_MASK        0x40
#define GC_USB_DIEPMSK_INEPNAKEFFMSK_SIZE        0x1
#define GC_USB_DIEPMSK_INEPNAKEFFMSK_DEFAULT     0x0
#define GC_USB_DIEPMSK_INEPNAKEFFMSK_OFFSET      0x810
#define GC_USB_DIEPMSK_RESERVED7_LSB             0x7
#define GC_USB_DIEPMSK_RESERVED7_MASK            0x80
#define GC_USB_DIEPMSK_RESERVED7_SIZE            0x1
#define GC_USB_DIEPMSK_RESERVED7_DEFAULT         0x1
#define GC_USB_DIEPMSK_RESERVED7_OFFSET          0x810
#define GC_USB_DIEPMSK_TXFIFOUNDRNMSK_LSB        0x8
#define GC_USB_DIEPMSK_TXFIFOUNDRNMSK_MASK       0x100
#define GC_USB_DIEPMSK_TXFIFOUNDRNMSK_SIZE       0x1
#define GC_USB_DIEPMSK_TXFIFOUNDRNMSK_DEFAULT    0x0
#define GC_USB_DIEPMSK_TXFIFOUNDRNMSK_OFFSET     0x810
#define GC_USB_DIEPMSK_BNAININTRMSK_LSB          0x9
#define GC_USB_DIEPMSK_BNAININTRMSK_MASK         0x200
#define GC_USB_DIEPMSK_BNAININTRMSK_SIZE         0x1
#define GC_USB_DIEPMSK_BNAININTRMSK_DEFAULT      0x0
#define GC_USB_DIEPMSK_BNAININTRMSK_OFFSET       0x810
#define GC_USB_DIEPMSK_NAKMSK_LSB                0xd
#define GC_USB_DIEPMSK_NAKMSK_MASK               0x2000
#define GC_USB_DIEPMSK_NAKMSK_SIZE               0x1
#define GC_USB_DIEPMSK_NAKMSK_DEFAULT            0x0
#define GC_USB_DIEPMSK_NAKMSK_OFFSET             0x810
#define GC_USB_DOEPMSK_XFERCOMPLMSK_LSB          0x0
#define GC_USB_DOEPMSK_XFERCOMPLMSK_MASK         0x1
#define GC_USB_DOEPMSK_XFERCOMPLMSK_SIZE         0x1
#define GC_USB_DOEPMSK_XFERCOMPLMSK_DEFAULT      0x0
#define GC_USB_DOEPMSK_XFERCOMPLMSK_OFFSET       0x814
#define GC_USB_DOEPMSK_EPDISBLDMSK_LSB           0x1
#define GC_USB_DOEPMSK_EPDISBLDMSK_MASK          0x2
#define GC_USB_DOEPMSK_EPDISBLDMSK_SIZE          0x1
#define GC_USB_DOEPMSK_EPDISBLDMSK_DEFAULT       0x0
#define GC_USB_DOEPMSK_EPDISBLDMSK_OFFSET        0x814
#define GC_USB_DOEPMSK_AHBERRMSK_LSB             0x2
#define GC_USB_DOEPMSK_AHBERRMSK_MASK            0x4
#define GC_USB_DOEPMSK_AHBERRMSK_SIZE            0x1
#define GC_USB_DOEPMSK_AHBERRMSK_DEFAULT         0x0
#define GC_USB_DOEPMSK_AHBERRMSK_OFFSET          0x814
#define GC_USB_DOEPMSK_SETUPMSK_LSB              0x3
#define GC_USB_DOEPMSK_SETUPMSK_MASK             0x8
#define GC_USB_DOEPMSK_SETUPMSK_SIZE             0x1
#define GC_USB_DOEPMSK_SETUPMSK_DEFAULT          0x0
#define GC_USB_DOEPMSK_SETUPMSK_OFFSET           0x814
#define GC_USB_DOEPMSK_OUTTKNEPDISMSK_LSB        0x4
#define GC_USB_DOEPMSK_OUTTKNEPDISMSK_MASK       0x10
#define GC_USB_DOEPMSK_OUTTKNEPDISMSK_SIZE       0x1
#define GC_USB_DOEPMSK_OUTTKNEPDISMSK_DEFAULT    0x0
#define GC_USB_DOEPMSK_OUTTKNEPDISMSK_OFFSET     0x814
#define GC_USB_DOEPMSK_STSPHSERCVDMSK_LSB        0x5
#define GC_USB_DOEPMSK_STSPHSERCVDMSK_MASK       0x20
#define GC_USB_DOEPMSK_STSPHSERCVDMSK_SIZE       0x1
#define GC_USB_DOEPMSK_STSPHSERCVDMSK_DEFAULT    0x0
#define GC_USB_DOEPMSK_STSPHSERCVDMSK_OFFSET     0x814
#define GC_USB_DOEPMSK_BACK2BACKSETUP_LSB        0x6
#define GC_USB_DOEPMSK_BACK2BACKSETUP_MASK       0x40
#define GC_USB_DOEPMSK_BACK2BACKSETUP_SIZE       0x1
#define GC_USB_DOEPMSK_BACK2BACKSETUP_DEFAULT    0x0
#define GC_USB_DOEPMSK_BACK2BACKSETUP_OFFSET     0x814
#define GC_USB_DOEPMSK_OUTPKTERRMSK_LSB          0x8
#define GC_USB_DOEPMSK_OUTPKTERRMSK_MASK         0x100
#define GC_USB_DOEPMSK_OUTPKTERRMSK_SIZE         0x1
#define GC_USB_DOEPMSK_OUTPKTERRMSK_DEFAULT      0x0
#define GC_USB_DOEPMSK_OUTPKTERRMSK_OFFSET       0x814
#define GC_USB_DOEPMSK_BNAOUTINTRMSK_LSB         0x9
#define GC_USB_DOEPMSK_BNAOUTINTRMSK_MASK        0x200
#define GC_USB_DOEPMSK_BNAOUTINTRMSK_SIZE        0x1
#define GC_USB_DOEPMSK_BNAOUTINTRMSK_DEFAULT     0x0
#define GC_USB_DOEPMSK_BNAOUTINTRMSK_OFFSET      0x814
#define GC_USB_DOEPMSK_BBLEERRMSK_LSB            0xc
#define GC_USB_DOEPMSK_BBLEERRMSK_MASK           0x1000
#define GC_USB_DOEPMSK_BBLEERRMSK_SIZE           0x1
#define GC_USB_DOEPMSK_BBLEERRMSK_DEFAULT        0x0
#define GC_USB_DOEPMSK_BBLEERRMSK_OFFSET         0x814
#define GC_USB_DOEPMSK_NAKMSK_LSB                0xd
#define GC_USB_DOEPMSK_NAKMSK_MASK               0x2000
#define GC_USB_DOEPMSK_NAKMSK_SIZE               0x1
#define GC_USB_DOEPMSK_NAKMSK_DEFAULT            0x0
#define GC_USB_DOEPMSK_NAKMSK_OFFSET             0x814
#define GC_USB_DOEPMSK_NYETMSK_LSB               0xe
#define GC_USB_DOEPMSK_NYETMSK_MASK              0x4000
#define GC_USB_DOEPMSK_NYETMSK_SIZE              0x1
#define GC_USB_DOEPMSK_NYETMSK_DEFAULT           0x0
#define GC_USB_DOEPMSK_NYETMSK_OFFSET            0x814
#define GC_USB_DAINT_INEPINT0_LSB                0x0
#define GC_USB_DAINT_INEPINT0_MASK               0x1
#define GC_USB_DAINT_INEPINT0_SIZE               0x1
#define GC_USB_DAINT_INEPINT0_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT0_OFFSET             0x818
#define GC_USB_DAINT_INEPINT1_LSB                0x1
#define GC_USB_DAINT_INEPINT1_MASK               0x2
#define GC_USB_DAINT_INEPINT1_SIZE               0x1
#define GC_USB_DAINT_INEPINT1_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT1_OFFSET             0x818
#define GC_USB_DAINT_INEPINT2_LSB                0x2
#define GC_USB_DAINT_INEPINT2_MASK               0x4
#define GC_USB_DAINT_INEPINT2_SIZE               0x1
#define GC_USB_DAINT_INEPINT2_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT2_OFFSET             0x818
#define GC_USB_DAINT_INEPINT3_LSB                0x3
#define GC_USB_DAINT_INEPINT3_MASK               0x8
#define GC_USB_DAINT_INEPINT3_SIZE               0x1
#define GC_USB_DAINT_INEPINT3_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT3_OFFSET             0x818
#define GC_USB_DAINT_INEPINT4_LSB                0x4
#define GC_USB_DAINT_INEPINT4_MASK               0x10
#define GC_USB_DAINT_INEPINT4_SIZE               0x1
#define GC_USB_DAINT_INEPINT4_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT4_OFFSET             0x818
#define GC_USB_DAINT_INEPINT5_LSB                0x5
#define GC_USB_DAINT_INEPINT5_MASK               0x20
#define GC_USB_DAINT_INEPINT5_SIZE               0x1
#define GC_USB_DAINT_INEPINT5_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT5_OFFSET             0x818
#define GC_USB_DAINT_INEPINT6_LSB                0x6
#define GC_USB_DAINT_INEPINT6_MASK               0x40
#define GC_USB_DAINT_INEPINT6_SIZE               0x1
#define GC_USB_DAINT_INEPINT6_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT6_OFFSET             0x818
#define GC_USB_DAINT_INEPINT7_LSB                0x7
#define GC_USB_DAINT_INEPINT7_MASK               0x80
#define GC_USB_DAINT_INEPINT7_SIZE               0x1
#define GC_USB_DAINT_INEPINT7_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT7_OFFSET             0x818
#define GC_USB_DAINT_INEPINT8_LSB                0x8
#define GC_USB_DAINT_INEPINT8_MASK               0x100
#define GC_USB_DAINT_INEPINT8_SIZE               0x1
#define GC_USB_DAINT_INEPINT8_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT8_OFFSET             0x818
#define GC_USB_DAINT_INEPINT9_LSB                0x9
#define GC_USB_DAINT_INEPINT9_MASK               0x200
#define GC_USB_DAINT_INEPINT9_SIZE               0x1
#define GC_USB_DAINT_INEPINT9_DEFAULT            0x0
#define GC_USB_DAINT_INEPINT9_OFFSET             0x818
#define GC_USB_DAINT_INEPINT10_LSB               0xa
#define GC_USB_DAINT_INEPINT10_MASK              0x400
#define GC_USB_DAINT_INEPINT10_SIZE              0x1
#define GC_USB_DAINT_INEPINT10_DEFAULT           0x0
#define GC_USB_DAINT_INEPINT10_OFFSET            0x818
#define GC_USB_DAINT_INEPINT11_LSB               0xb
#define GC_USB_DAINT_INEPINT11_MASK              0x800
#define GC_USB_DAINT_INEPINT11_SIZE              0x1
#define GC_USB_DAINT_INEPINT11_DEFAULT           0x0
#define GC_USB_DAINT_INEPINT11_OFFSET            0x818
#define GC_USB_DAINT_INEPINT12_LSB               0xc
#define GC_USB_DAINT_INEPINT12_MASK              0x1000
#define GC_USB_DAINT_INEPINT12_SIZE              0x1
#define GC_USB_DAINT_INEPINT12_DEFAULT           0x0
#define GC_USB_DAINT_INEPINT12_OFFSET            0x818
#define GC_USB_DAINT_INEPINT13_LSB               0xd
#define GC_USB_DAINT_INEPINT13_MASK              0x2000
#define GC_USB_DAINT_INEPINT13_SIZE              0x1
#define GC_USB_DAINT_INEPINT13_DEFAULT           0x0
#define GC_USB_DAINT_INEPINT13_OFFSET            0x818
#define GC_USB_DAINT_INEPINT14_LSB               0xe
#define GC_USB_DAINT_INEPINT14_MASK              0x4000
#define GC_USB_DAINT_INEPINT14_SIZE              0x1
#define GC_USB_DAINT_INEPINT14_DEFAULT           0x0
#define GC_USB_DAINT_INEPINT14_OFFSET            0x818
#define GC_USB_DAINT_INEPINT15_LSB               0xf
#define GC_USB_DAINT_INEPINT15_MASK              0x8000
#define GC_USB_DAINT_INEPINT15_SIZE              0x1
#define GC_USB_DAINT_INEPINT15_DEFAULT           0x0
#define GC_USB_DAINT_INEPINT15_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT0_LSB               0x10
#define GC_USB_DAINT_OUTEPINT0_MASK              0x10000
#define GC_USB_DAINT_OUTEPINT0_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT0_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT0_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT1_LSB               0x11
#define GC_USB_DAINT_OUTEPINT1_MASK              0x20000
#define GC_USB_DAINT_OUTEPINT1_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT1_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT1_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT2_LSB               0x12
#define GC_USB_DAINT_OUTEPINT2_MASK              0x40000
#define GC_USB_DAINT_OUTEPINT2_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT2_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT2_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT3_LSB               0x13
#define GC_USB_DAINT_OUTEPINT3_MASK              0x80000
#define GC_USB_DAINT_OUTEPINT3_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT3_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT3_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT4_LSB               0x14
#define GC_USB_DAINT_OUTEPINT4_MASK              0x100000
#define GC_USB_DAINT_OUTEPINT4_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT4_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT4_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT5_LSB               0x15
#define GC_USB_DAINT_OUTEPINT5_MASK              0x200000
#define GC_USB_DAINT_OUTEPINT5_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT5_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT5_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT6_LSB               0x16
#define GC_USB_DAINT_OUTEPINT6_MASK              0x400000
#define GC_USB_DAINT_OUTEPINT6_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT6_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT6_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT7_LSB               0x17
#define GC_USB_DAINT_OUTEPINT7_MASK              0x800000
#define GC_USB_DAINT_OUTEPINT7_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT7_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT7_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT8_LSB               0x18
#define GC_USB_DAINT_OUTEPINT8_MASK              0x1000000
#define GC_USB_DAINT_OUTEPINT8_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT8_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT8_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT9_LSB               0x19
#define GC_USB_DAINT_OUTEPINT9_MASK              0x2000000
#define GC_USB_DAINT_OUTEPINT9_SIZE              0x1
#define GC_USB_DAINT_OUTEPINT9_DEFAULT           0x0
#define GC_USB_DAINT_OUTEPINT9_OFFSET            0x818
#define GC_USB_DAINT_OUTEPINT10_LSB              0x1a
#define GC_USB_DAINT_OUTEPINT10_MASK             0x4000000
#define GC_USB_DAINT_OUTEPINT10_SIZE             0x1
#define GC_USB_DAINT_OUTEPINT10_DEFAULT          0x0
#define GC_USB_DAINT_OUTEPINT10_OFFSET           0x818
#define GC_USB_DAINT_OUTEPINT11_LSB              0x1b
#define GC_USB_DAINT_OUTEPINT11_MASK             0x8000000
#define GC_USB_DAINT_OUTEPINT11_SIZE             0x1
#define GC_USB_DAINT_OUTEPINT11_DEFAULT          0x0
#define GC_USB_DAINT_OUTEPINT11_OFFSET           0x818
#define GC_USB_DAINT_OUTEPINT12_LSB              0x1c
#define GC_USB_DAINT_OUTEPINT12_MASK             0x10000000
#define GC_USB_DAINT_OUTEPINT12_SIZE             0x1
#define GC_USB_DAINT_OUTEPINT12_DEFAULT          0x0
#define GC_USB_DAINT_OUTEPINT12_OFFSET           0x818
#define GC_USB_DAINT_OUTEPINT13_LSB              0x1d
#define GC_USB_DAINT_OUTEPINT13_MASK             0x20000000
#define GC_USB_DAINT_OUTEPINT13_SIZE             0x1
#define GC_USB_DAINT_OUTEPINT13_DEFAULT          0x0
#define GC_USB_DAINT_OUTEPINT13_OFFSET           0x818
#define GC_USB_DAINT_OUTEPINT14_LSB              0x1e
#define GC_USB_DAINT_OUTEPINT14_MASK             0x40000000
#define GC_USB_DAINT_OUTEPINT14_SIZE             0x1
#define GC_USB_DAINT_OUTEPINT14_DEFAULT          0x0
#define GC_USB_DAINT_OUTEPINT14_OFFSET           0x818
#define GC_USB_DAINT_OUTEPINT15_LSB              0x1f
#define GC_USB_DAINT_OUTEPINT15_MASK             0x80000000
#define GC_USB_DAINT_OUTEPINT15_SIZE             0x1
#define GC_USB_DAINT_OUTEPINT15_DEFAULT          0x0
#define GC_USB_DAINT_OUTEPINT15_OFFSET           0x818
#define GC_USB_DAINTMSK_INEPMSK0_LSB             0x0
#define GC_USB_DAINTMSK_INEPMSK0_MASK            0x1
#define GC_USB_DAINTMSK_INEPMSK0_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK0_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK0_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK1_LSB             0x1
#define GC_USB_DAINTMSK_INEPMSK1_MASK            0x2
#define GC_USB_DAINTMSK_INEPMSK1_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK1_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK1_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK2_LSB             0x2
#define GC_USB_DAINTMSK_INEPMSK2_MASK            0x4
#define GC_USB_DAINTMSK_INEPMSK2_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK2_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK2_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK3_LSB             0x3
#define GC_USB_DAINTMSK_INEPMSK3_MASK            0x8
#define GC_USB_DAINTMSK_INEPMSK3_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK3_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK3_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK4_LSB             0x4
#define GC_USB_DAINTMSK_INEPMSK4_MASK            0x10
#define GC_USB_DAINTMSK_INEPMSK4_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK4_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK4_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK5_LSB             0x5
#define GC_USB_DAINTMSK_INEPMSK5_MASK            0x20
#define GC_USB_DAINTMSK_INEPMSK5_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK5_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK5_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK6_LSB             0x6
#define GC_USB_DAINTMSK_INEPMSK6_MASK            0x40
#define GC_USB_DAINTMSK_INEPMSK6_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK6_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK6_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK7_LSB             0x7
#define GC_USB_DAINTMSK_INEPMSK7_MASK            0x80
#define GC_USB_DAINTMSK_INEPMSK7_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK7_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK7_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK8_LSB             0x8
#define GC_USB_DAINTMSK_INEPMSK8_MASK            0x100
#define GC_USB_DAINTMSK_INEPMSK8_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK8_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK8_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK9_LSB             0x9
#define GC_USB_DAINTMSK_INEPMSK9_MASK            0x200
#define GC_USB_DAINTMSK_INEPMSK9_SIZE            0x1
#define GC_USB_DAINTMSK_INEPMSK9_DEFAULT         0x0
#define GC_USB_DAINTMSK_INEPMSK9_OFFSET          0x81c
#define GC_USB_DAINTMSK_INEPMSK10_LSB            0xa
#define GC_USB_DAINTMSK_INEPMSK10_MASK           0x400
#define GC_USB_DAINTMSK_INEPMSK10_SIZE           0x1
#define GC_USB_DAINTMSK_INEPMSK10_DEFAULT        0x0
#define GC_USB_DAINTMSK_INEPMSK10_OFFSET         0x81c
#define GC_USB_DAINTMSK_INEPMSK11_LSB            0xb
#define GC_USB_DAINTMSK_INEPMSK11_MASK           0x800
#define GC_USB_DAINTMSK_INEPMSK11_SIZE           0x1
#define GC_USB_DAINTMSK_INEPMSK11_DEFAULT        0x0
#define GC_USB_DAINTMSK_INEPMSK11_OFFSET         0x81c
#define GC_USB_DAINTMSK_INEPMSK12_LSB            0xc
#define GC_USB_DAINTMSK_INEPMSK12_MASK           0x1000
#define GC_USB_DAINTMSK_INEPMSK12_SIZE           0x1
#define GC_USB_DAINTMSK_INEPMSK12_DEFAULT        0x0
#define GC_USB_DAINTMSK_INEPMSK12_OFFSET         0x81c
#define GC_USB_DAINTMSK_INEPMSK13_LSB            0xd
#define GC_USB_DAINTMSK_INEPMSK13_MASK           0x2000
#define GC_USB_DAINTMSK_INEPMSK13_SIZE           0x1
#define GC_USB_DAINTMSK_INEPMSK13_DEFAULT        0x0
#define GC_USB_DAINTMSK_INEPMSK13_OFFSET         0x81c
#define GC_USB_DAINTMSK_INEPMSK14_LSB            0xe
#define GC_USB_DAINTMSK_INEPMSK14_MASK           0x4000
#define GC_USB_DAINTMSK_INEPMSK14_SIZE           0x1
#define GC_USB_DAINTMSK_INEPMSK14_DEFAULT        0x0
#define GC_USB_DAINTMSK_INEPMSK14_OFFSET         0x81c
#define GC_USB_DAINTMSK_INEPMSK15_LSB            0xf
#define GC_USB_DAINTMSK_INEPMSK15_MASK           0x8000
#define GC_USB_DAINTMSK_INEPMSK15_SIZE           0x1
