FrameworkComputer/EmbeddedController/chip/stm32/usb_dwc_registers.h
#define GC_USB_DIEPCTL7_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL7_EPDIS_OFFSET             0x9e0
#define GC_USB_DIEPCTL7_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL7_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL7_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL7_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL7_EPENA_OFFSET             0x9e0
#define GC_USB_DIEPINT7_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT7_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT7_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT7_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT7_XFERCOMPL_OFFSET         0x9e8
#define GC_USB_DIEPINT7_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT7_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT7_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT7_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT7_EPDISBLD_OFFSET          0x9e8
#define GC_USB_DIEPINT7_AHBERR_LSB               0x2
#define GC_USB_DIEPINT7_AHBERR_MASK              0x4
#define GC_USB_DIEPINT7_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT7_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT7_AHBERR_OFFSET            0x9e8
#define GC_USB_DIEPINT7_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT7_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT7_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT7_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT7_TIMEOUT_OFFSET           0x9e8
#define GC_USB_DIEPINT7_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT7_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT7_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT7_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT7_INTKNTXFEMP_OFFSET       0x9e8
#define GC_USB_DIEPINT7_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT7_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT7_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT7_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT7_INTKNEPMIS_OFFSET        0x9e8
#define GC_USB_DIEPINT7_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT7_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT7_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT7_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT7_INEPNAKEFF_OFFSET        0x9e8
#define GC_USB_DIEPINT7_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT7_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT7_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT7_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT7_TXFEMP_OFFSET            0x9e8
#define GC_USB_DIEPINT7_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT7_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT7_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT7_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT7_TXFIFOUNDRN_OFFSET       0x9e8
#define GC_USB_DIEPINT7_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT7_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT7_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT7_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT7_BNAINTR_OFFSET           0x9e8
#define GC_USB_DIEPINT7_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT7_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT7_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT7_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT7_PKTDRPSTS_OFFSET         0x9e8
#define GC_USB_DIEPINT7_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT7_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT7_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT7_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT7_BBLEERR_OFFSET           0x9e8
#define GC_USB_DIEPINT7_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT7_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT7_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT7_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT7_NAKINTRPT_OFFSET         0x9e8
#define GC_USB_DIEPINT7_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT7_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT7_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT7_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT7_NYETINTRPT_OFFSET        0x9e8
#define GC_USB_DIEPTSIZ7_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ7_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ7_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ7_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ7_XFERSIZE_OFFSET         0x9f0
#define GC_USB_DIEPTSIZ7_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ7_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ7_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ7_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ7_PKTCNT_OFFSET           0x9f0
#define GC_USB_DIEPTSIZ7_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ7_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ7_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ7_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ7_MC_OFFSET               0x9f0
#define GC_USB_DIEPDMA7_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA7_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA7_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA7_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA7_DMAADDR_OFFSET           0x9f4
#define GC_USB_DTXFSTS7_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS7_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS7_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS7_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS7_INEPTXFSPCAVAIL_OFFSET   0x9f8
#define GC_USB_DIEPDMAB7_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB7_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB7_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB7_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB7_DMABUFFERADDR_OFFSET    0x9fc
#define GC_USB_DIEPCTL8_MPS_LSB                  0x0
#define GC_USB_DIEPCTL8_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL8_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL8_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL8_MPS_OFFSET               0xa00
#define GC_USB_DIEPCTL8_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL8_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL8_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL8_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL8_USBACTEP_OFFSET          0xa00
#define GC_USB_DIEPCTL8_DPID_LSB                 0x10
#define GC_USB_DIEPCTL8_DPID_MASK                0x10000
#define GC_USB_DIEPCTL8_DPID_SIZE                0x1
#define GC_USB_DIEPCTL8_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL8_DPID_OFFSET              0xa00
#define GC_USB_DIEPCTL8_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL8_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL8_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL8_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL8_NAKSTS_OFFSET            0xa00
#define GC_USB_DIEPCTL8_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL8_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL8_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL8_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL8_EPTYPE_OFFSET            0xa00
#define GC_USB_DIEPCTL8_STALL_LSB                0x15
#define GC_USB_DIEPCTL8_STALL_MASK               0x200000
#define GC_USB_DIEPCTL8_STALL_SIZE               0x1
#define GC_USB_DIEPCTL8_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL8_STALL_OFFSET             0xa00
#define GC_USB_DIEPCTL8_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL8_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL8_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL8_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL8_TXFNUM_OFFSET            0xa00
#define GC_USB_DIEPCTL8_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL8_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL8_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL8_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL8_CNAK_OFFSET              0xa00
#define GC_USB_DIEPCTL8_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL8_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL8_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL8_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL8_SNAK_OFFSET              0xa00
#define GC_USB_DIEPCTL8_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL8_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL8_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL8_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL8_SETD0PID_OFFSET          0xa00
#define GC_USB_DIEPCTL8_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL8_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL8_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL8_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL8_SETD1PID_OFFSET          0xa00
#define GC_USB_DIEPCTL8_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL8_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL8_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL8_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL8_EPDIS_OFFSET             0xa00
#define GC_USB_DIEPCTL8_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL8_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL8_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL8_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL8_EPENA_OFFSET             0xa00
#define GC_USB_DIEPINT8_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT8_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT8_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT8_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT8_XFERCOMPL_OFFSET         0xa08
#define GC_USB_DIEPINT8_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT8_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT8_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT8_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT8_EPDISBLD_OFFSET          0xa08
#define GC_USB_DIEPINT8_AHBERR_LSB               0x2
#define GC_USB_DIEPINT8_AHBERR_MASK              0x4
#define GC_USB_DIEPINT8_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT8_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT8_AHBERR_OFFSET            0xa08
#define GC_USB_DIEPINT8_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT8_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT8_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT8_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT8_TIMEOUT_OFFSET           0xa08
#define GC_USB_DIEPINT8_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT8_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT8_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT8_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT8_INTKNTXFEMP_OFFSET       0xa08
#define GC_USB_DIEPINT8_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT8_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT8_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT8_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT8_INTKNEPMIS_OFFSET        0xa08
#define GC_USB_DIEPINT8_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT8_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT8_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT8_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT8_INEPNAKEFF_OFFSET        0xa08
#define GC_USB_DIEPINT8_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT8_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT8_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT8_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT8_TXFEMP_OFFSET            0xa08
#define GC_USB_DIEPINT8_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT8_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT8_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT8_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT8_TXFIFOUNDRN_OFFSET       0xa08
#define GC_USB_DIEPINT8_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT8_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT8_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT8_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT8_BNAINTR_OFFSET           0xa08
#define GC_USB_DIEPINT8_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT8_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT8_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT8_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT8_PKTDRPSTS_OFFSET         0xa08
#define GC_USB_DIEPINT8_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT8_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT8_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT8_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT8_BBLEERR_OFFSET           0xa08
#define GC_USB_DIEPINT8_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT8_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT8_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT8_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT8_NAKINTRPT_OFFSET         0xa08
#define GC_USB_DIEPINT8_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT8_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT8_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT8_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT8_NYETINTRPT_OFFSET        0xa08
#define GC_USB_DIEPTSIZ8_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ8_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ8_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ8_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ8_XFERSIZE_OFFSET         0xa10
#define GC_USB_DIEPTSIZ8_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ8_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ8_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ8_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ8_PKTCNT_OFFSET           0xa10
#define GC_USB_DIEPTSIZ8_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ8_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ8_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ8_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ8_MC_OFFSET               0xa10
#define GC_USB_DIEPDMA8_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA8_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA8_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA8_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA8_DMAADDR_OFFSET           0xa14
#define GC_USB_DTXFSTS8_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS8_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS8_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS8_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS8_INEPTXFSPCAVAIL_OFFSET   0xa18
#define GC_USB_DIEPDMAB8_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB8_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB8_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB8_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB8_DMABUFFERADDR_OFFSET    0xa1c
#define GC_USB_DIEPCTL9_MPS_LSB                  0x0
#define GC_USB_DIEPCTL9_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL9_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL9_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL9_MPS_OFFSET               0xa20
#define GC_USB_DIEPCTL9_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL9_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL9_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL9_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL9_USBACTEP_OFFSET          0xa20
#define GC_USB_DIEPCTL9_DPID_LSB                 0x10
#define GC_USB_DIEPCTL9_DPID_MASK                0x10000
#define GC_USB_DIEPCTL9_DPID_SIZE                0x1
#define GC_USB_DIEPCTL9_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL9_DPID_OFFSET              0xa20
#define GC_USB_DIEPCTL9_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL9_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL9_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL9_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL9_NAKSTS_OFFSET            0xa20
#define GC_USB_DIEPCTL9_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL9_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL9_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL9_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL9_EPTYPE_OFFSET            0xa20
#define GC_USB_DIEPCTL9_STALL_LSB                0x15
#define GC_USB_DIEPCTL9_STALL_MASK               0x200000
#define GC_USB_DIEPCTL9_STALL_SIZE               0x1
#define GC_USB_DIEPCTL9_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL9_STALL_OFFSET             0xa20
#define GC_USB_DIEPCTL9_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL9_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL9_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL9_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL9_TXFNUM_OFFSET            0xa20
#define GC_USB_DIEPCTL9_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL9_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL9_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL9_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL9_CNAK_OFFSET              0xa20
#define GC_USB_DIEPCTL9_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL9_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL9_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL9_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL9_SNAK_OFFSET              0xa20
#define GC_USB_DIEPCTL9_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL9_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL9_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL9_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL9_SETD0PID_OFFSET          0xa20
#define GC_USB_DIEPCTL9_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL9_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL9_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL9_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL9_SETD1PID_OFFSET          0xa20
#define GC_USB_DIEPCTL9_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL9_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL9_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL9_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL9_EPDIS_OFFSET             0xa20
#define GC_USB_DIEPCTL9_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL9_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL9_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL9_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL9_EPENA_OFFSET             0xa20
#define GC_USB_DIEPINT9_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT9_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT9_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT9_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT9_XFERCOMPL_OFFSET         0xa28
#define GC_USB_DIEPINT9_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT9_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT9_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT9_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT9_EPDISBLD_OFFSET          0xa28
#define GC_USB_DIEPINT9_AHBERR_LSB               0x2
#define GC_USB_DIEPINT9_AHBERR_MASK              0x4
#define GC_USB_DIEPINT9_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT9_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT9_AHBERR_OFFSET            0xa28
#define GC_USB_DIEPINT9_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT9_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT9_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT9_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT9_TIMEOUT_OFFSET           0xa28
#define GC_USB_DIEPINT9_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT9_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT9_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT9_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT9_INTKNTXFEMP_OFFSET       0xa28
#define GC_USB_DIEPINT9_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT9_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT9_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT9_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT9_INTKNEPMIS_OFFSET        0xa28
#define GC_USB_DIEPINT9_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT9_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT9_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT9_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT9_INEPNAKEFF_OFFSET        0xa28
#define GC_USB_DIEPINT9_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT9_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT9_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT9_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT9_TXFEMP_OFFSET            0xa28
#define GC_USB_DIEPINT9_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT9_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT9_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT9_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT9_TXFIFOUNDRN_OFFSET       0xa28
#define GC_USB_DIEPINT9_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT9_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT9_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT9_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT9_BNAINTR_OFFSET           0xa28
#define GC_USB_DIEPINT9_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT9_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT9_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT9_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT9_PKTDRPSTS_OFFSET         0xa28
#define GC_USB_DIEPINT9_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT9_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT9_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT9_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT9_BBLEERR_OFFSET           0xa28
#define GC_USB_DIEPINT9_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT9_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT9_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT9_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT9_NAKINTRPT_OFFSET         0xa28
#define GC_USB_DIEPINT9_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT9_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT9_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT9_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT9_NYETINTRPT_OFFSET        0xa28
#define GC_USB_DIEPTSIZ9_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ9_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ9_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ9_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ9_XFERSIZE_OFFSET         0xa30
#define GC_USB_DIEPTSIZ9_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ9_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ9_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ9_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ9_PKTCNT_OFFSET           0xa30
#define GC_USB_DIEPTSIZ9_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ9_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ9_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ9_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ9_MC_OFFSET               0xa30
#define GC_USB_DIEPDMA9_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA9_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA9_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA9_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA9_DMAADDR_OFFSET           0xa34
#define GC_USB_DTXFSTS9_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS9_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS9_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS9_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS9_INEPTXFSPCAVAIL_OFFSET   0xa38
#define GC_USB_DIEPDMAB9_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB9_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB9_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB9_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB9_DMABUFFERADDR_OFFSET    0xa3c
#define GC_USB_DIEPCTL10_MPS_LSB                 0x0
#define GC_USB_DIEPCTL10_MPS_MASK                0x7ff
#define GC_USB_DIEPCTL10_MPS_SIZE                0xb
#define GC_USB_DIEPCTL10_MPS_DEFAULT             0x0
#define GC_USB_DIEPCTL10_MPS_OFFSET              0xa40
