FrameworkComputer/EmbeddedController/chip/stm32/usb_dwc_registers.h
#define GC_USB_DIEPINT12_PKTDRPSTS_SIZE          0x1
#define GC_USB_DIEPINT12_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DIEPINT12_PKTDRPSTS_OFFSET        0xa88
#define GC_USB_DIEPINT12_BBLEERR_LSB             0xc
#define GC_USB_DIEPINT12_BBLEERR_MASK            0x1000
#define GC_USB_DIEPINT12_BBLEERR_SIZE            0x1
#define GC_USB_DIEPINT12_BBLEERR_DEFAULT         0x0
#define GC_USB_DIEPINT12_BBLEERR_OFFSET          0xa88
#define GC_USB_DIEPINT12_NAKINTRPT_LSB           0xd
#define GC_USB_DIEPINT12_NAKINTRPT_MASK          0x2000
#define GC_USB_DIEPINT12_NAKINTRPT_SIZE          0x1
#define GC_USB_DIEPINT12_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT12_NAKINTRPT_OFFSET        0xa88
#define GC_USB_DIEPINT12_NYETINTRPT_LSB          0xe
#define GC_USB_DIEPINT12_NYETINTRPT_MASK         0x4000
#define GC_USB_DIEPINT12_NYETINTRPT_SIZE         0x1
#define GC_USB_DIEPINT12_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DIEPINT12_NYETINTRPT_OFFSET       0xa88
#define GC_USB_DIEPTSIZ12_XFERSIZE_LSB           0x0
#define GC_USB_DIEPTSIZ12_XFERSIZE_MASK          0x7ffff
#define GC_USB_DIEPTSIZ12_XFERSIZE_SIZE          0x13
#define GC_USB_DIEPTSIZ12_XFERSIZE_DEFAULT       0x0
#define GC_USB_DIEPTSIZ12_XFERSIZE_OFFSET        0xa90
#define GC_USB_DIEPTSIZ12_PKTCNT_LSB             0x13
#define GC_USB_DIEPTSIZ12_PKTCNT_MASK            0x1ff80000
#define GC_USB_DIEPTSIZ12_PKTCNT_SIZE            0xa
#define GC_USB_DIEPTSIZ12_PKTCNT_DEFAULT         0x0
#define GC_USB_DIEPTSIZ12_PKTCNT_OFFSET          0xa90
#define GC_USB_DIEPTSIZ12_MC_LSB                 0x1d
#define GC_USB_DIEPTSIZ12_MC_MASK                0x60000000
#define GC_USB_DIEPTSIZ12_MC_SIZE                0x2
#define GC_USB_DIEPTSIZ12_MC_DEFAULT             0x0
#define GC_USB_DIEPTSIZ12_MC_OFFSET              0xa90
#define GC_USB_DIEPDMA12_DMAADDR_LSB             0x0
#define GC_USB_DIEPDMA12_DMAADDR_MASK            0xffffffff
#define GC_USB_DIEPDMA12_DMAADDR_SIZE            0x20
#define GC_USB_DIEPDMA12_DMAADDR_DEFAULT         0x0
#define GC_USB_DIEPDMA12_DMAADDR_OFFSET          0xa94
#define GC_USB_DTXFSTS12_INEPTXFSPCAVAIL_LSB     0x0
#define GC_USB_DTXFSTS12_INEPTXFSPCAVAIL_MASK    0xffff
#define GC_USB_DTXFSTS12_INEPTXFSPCAVAIL_SIZE    0x10
#define GC_USB_DTXFSTS12_INEPTXFSPCAVAIL_DEFAULT 0x0
#define GC_USB_DTXFSTS12_INEPTXFSPCAVAIL_OFFSET  0xa98
#define GC_USB_DIEPDMAB12_DMABUFFERADDR_LSB      0x0
#define GC_USB_DIEPDMAB12_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DIEPDMAB12_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DIEPDMAB12_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DIEPDMAB12_DMABUFFERADDR_OFFSET   0xa9c
#define GC_USB_DIEPCTL13_MPS_LSB                 0x0
#define GC_USB_DIEPCTL13_MPS_MASK                0x7ff
#define GC_USB_DIEPCTL13_MPS_SIZE                0xb
#define GC_USB_DIEPCTL13_MPS_DEFAULT             0x0
#define GC_USB_DIEPCTL13_MPS_OFFSET              0xaa0
#define GC_USB_DIEPCTL13_USBACTEP_LSB            0xf
#define GC_USB_DIEPCTL13_USBACTEP_MASK           0x8000
#define GC_USB_DIEPCTL13_USBACTEP_SIZE           0x1
#define GC_USB_DIEPCTL13_USBACTEP_DEFAULT        0x0
#define GC_USB_DIEPCTL13_USBACTEP_OFFSET         0xaa0
#define GC_USB_DIEPCTL13_DPID_LSB                0x10
#define GC_USB_DIEPCTL13_DPID_MASK               0x10000
#define GC_USB_DIEPCTL13_DPID_SIZE               0x1
#define GC_USB_DIEPCTL13_DPID_DEFAULT            0x0
#define GC_USB_DIEPCTL13_DPID_OFFSET             0xaa0
#define GC_USB_DIEPCTL13_NAKSTS_LSB              0x11
#define GC_USB_DIEPCTL13_NAKSTS_MASK             0x20000
#define GC_USB_DIEPCTL13_NAKSTS_SIZE             0x1
#define GC_USB_DIEPCTL13_NAKSTS_DEFAULT          0x0
#define GC_USB_DIEPCTL13_NAKSTS_OFFSET           0xaa0
#define GC_USB_DIEPCTL13_EPTYPE_LSB              0x12
#define GC_USB_DIEPCTL13_EPTYPE_MASK             0xc0000
#define GC_USB_DIEPCTL13_EPTYPE_SIZE             0x2
#define GC_USB_DIEPCTL13_EPTYPE_DEFAULT          0x0
#define GC_USB_DIEPCTL13_EPTYPE_OFFSET           0xaa0
#define GC_USB_DIEPCTL13_STALL_LSB               0x15
#define GC_USB_DIEPCTL13_STALL_MASK              0x200000
#define GC_USB_DIEPCTL13_STALL_SIZE              0x1
#define GC_USB_DIEPCTL13_STALL_DEFAULT           0x0
#define GC_USB_DIEPCTL13_STALL_OFFSET            0xaa0
#define GC_USB_DIEPCTL13_TXFNUM_LSB              0x16
#define GC_USB_DIEPCTL13_TXFNUM_MASK             0x3c00000
#define GC_USB_DIEPCTL13_TXFNUM_SIZE             0x4
#define GC_USB_DIEPCTL13_TXFNUM_DEFAULT          0x0
#define GC_USB_DIEPCTL13_TXFNUM_OFFSET           0xaa0
#define GC_USB_DIEPCTL13_CNAK_LSB                0x1a
#define GC_USB_DIEPCTL13_CNAK_MASK               0x4000000
#define GC_USB_DIEPCTL13_CNAK_SIZE               0x1
#define GC_USB_DIEPCTL13_CNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL13_CNAK_OFFSET             0xaa0
#define GC_USB_DIEPCTL13_SNAK_LSB                0x1b
#define GC_USB_DIEPCTL13_SNAK_MASK               0x8000000
#define GC_USB_DIEPCTL13_SNAK_SIZE               0x1
#define GC_USB_DIEPCTL13_SNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL13_SNAK_OFFSET             0xaa0
#define GC_USB_DIEPCTL13_SETD0PID_LSB            0x1c
#define GC_USB_DIEPCTL13_SETD0PID_MASK           0x10000000
#define GC_USB_DIEPCTL13_SETD0PID_SIZE           0x1
#define GC_USB_DIEPCTL13_SETD0PID_DEFAULT        0x0
#define GC_USB_DIEPCTL13_SETD0PID_OFFSET         0xaa0
#define GC_USB_DIEPCTL13_SETD1PID_LSB            0x1d
#define GC_USB_DIEPCTL13_SETD1PID_MASK           0x20000000
#define GC_USB_DIEPCTL13_SETD1PID_SIZE           0x1
#define GC_USB_DIEPCTL13_SETD1PID_DEFAULT        0x0
#define GC_USB_DIEPCTL13_SETD1PID_OFFSET         0xaa0
#define GC_USB_DIEPCTL13_EPDIS_LSB               0x1e
#define GC_USB_DIEPCTL13_EPDIS_MASK              0x40000000
#define GC_USB_DIEPCTL13_EPDIS_SIZE              0x1
#define GC_USB_DIEPCTL13_EPDIS_DEFAULT           0x0
#define GC_USB_DIEPCTL13_EPDIS_OFFSET            0xaa0
#define GC_USB_DIEPCTL13_EPENA_LSB               0x1f
#define GC_USB_DIEPCTL13_EPENA_MASK              0x80000000
#define GC_USB_DIEPCTL13_EPENA_SIZE              0x1
#define GC_USB_DIEPCTL13_EPENA_DEFAULT           0x0
#define GC_USB_DIEPCTL13_EPENA_OFFSET            0xaa0
#define GC_USB_DIEPINT13_XFERCOMPL_LSB           0x0
#define GC_USB_DIEPINT13_XFERCOMPL_MASK          0x1
#define GC_USB_DIEPINT13_XFERCOMPL_SIZE          0x1
#define GC_USB_DIEPINT13_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DIEPINT13_XFERCOMPL_OFFSET        0xaa8
#define GC_USB_DIEPINT13_EPDISBLD_LSB            0x1
#define GC_USB_DIEPINT13_EPDISBLD_MASK           0x2
#define GC_USB_DIEPINT13_EPDISBLD_SIZE           0x1
#define GC_USB_DIEPINT13_EPDISBLD_DEFAULT        0x0
#define GC_USB_DIEPINT13_EPDISBLD_OFFSET         0xaa8
#define GC_USB_DIEPINT13_AHBERR_LSB              0x2
#define GC_USB_DIEPINT13_AHBERR_MASK             0x4
#define GC_USB_DIEPINT13_AHBERR_SIZE             0x1
#define GC_USB_DIEPINT13_AHBERR_DEFAULT          0x0
#define GC_USB_DIEPINT13_AHBERR_OFFSET           0xaa8
#define GC_USB_DIEPINT13_TIMEOUT_LSB             0x3
#define GC_USB_DIEPINT13_TIMEOUT_MASK            0x8
#define GC_USB_DIEPINT13_TIMEOUT_SIZE            0x1
#define GC_USB_DIEPINT13_TIMEOUT_DEFAULT         0x0
#define GC_USB_DIEPINT13_TIMEOUT_OFFSET          0xaa8
#define GC_USB_DIEPINT13_INTKNTXFEMP_LSB         0x4
#define GC_USB_DIEPINT13_INTKNTXFEMP_MASK        0x10
#define GC_USB_DIEPINT13_INTKNTXFEMP_SIZE        0x1
#define GC_USB_DIEPINT13_INTKNTXFEMP_DEFAULT     0x0
#define GC_USB_DIEPINT13_INTKNTXFEMP_OFFSET      0xaa8
#define GC_USB_DIEPINT13_INTKNEPMIS_LSB          0x5
#define GC_USB_DIEPINT13_INTKNEPMIS_MASK         0x20
#define GC_USB_DIEPINT13_INTKNEPMIS_SIZE         0x1
#define GC_USB_DIEPINT13_INTKNEPMIS_DEFAULT      0x0
#define GC_USB_DIEPINT13_INTKNEPMIS_OFFSET       0xaa8
#define GC_USB_DIEPINT13_INEPNAKEFF_LSB          0x6
#define GC_USB_DIEPINT13_INEPNAKEFF_MASK         0x40
#define GC_USB_DIEPINT13_INEPNAKEFF_SIZE         0x1
#define GC_USB_DIEPINT13_INEPNAKEFF_DEFAULT      0x0
#define GC_USB_DIEPINT13_INEPNAKEFF_OFFSET       0xaa8
#define GC_USB_DIEPINT13_TXFEMP_LSB              0x7
#define GC_USB_DIEPINT13_TXFEMP_MASK             0x80
#define GC_USB_DIEPINT13_TXFEMP_SIZE             0x1
#define GC_USB_DIEPINT13_TXFEMP_DEFAULT          0x0
#define GC_USB_DIEPINT13_TXFEMP_OFFSET           0xaa8
#define GC_USB_DIEPINT13_TXFIFOUNDRN_LSB         0x8
#define GC_USB_DIEPINT13_TXFIFOUNDRN_MASK        0x100
#define GC_USB_DIEPINT13_TXFIFOUNDRN_SIZE        0x1
#define GC_USB_DIEPINT13_TXFIFOUNDRN_DEFAULT     0x0
#define GC_USB_DIEPINT13_TXFIFOUNDRN_OFFSET      0xaa8
#define GC_USB_DIEPINT13_BNAINTR_LSB             0x9
#define GC_USB_DIEPINT13_BNAINTR_MASK            0x200
#define GC_USB_DIEPINT13_BNAINTR_SIZE            0x1
#define GC_USB_DIEPINT13_BNAINTR_DEFAULT         0x0
#define GC_USB_DIEPINT13_BNAINTR_OFFSET          0xaa8
#define GC_USB_DIEPINT13_PKTDRPSTS_LSB           0xb
#define GC_USB_DIEPINT13_PKTDRPSTS_MASK          0x800
#define GC_USB_DIEPINT13_PKTDRPSTS_SIZE          0x1
#define GC_USB_DIEPINT13_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DIEPINT13_PKTDRPSTS_OFFSET        0xaa8
#define GC_USB_DIEPINT13_BBLEERR_LSB             0xc
#define GC_USB_DIEPINT13_BBLEERR_MASK            0x1000
#define GC_USB_DIEPINT13_BBLEERR_SIZE            0x1
#define GC_USB_DIEPINT13_BBLEERR_DEFAULT         0x0
#define GC_USB_DIEPINT13_BBLEERR_OFFSET          0xaa8
#define GC_USB_DIEPINT13_NAKINTRPT_LSB           0xd
#define GC_USB_DIEPINT13_NAKINTRPT_MASK          0x2000
#define GC_USB_DIEPINT13_NAKINTRPT_SIZE          0x1
#define GC_USB_DIEPINT13_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT13_NAKINTRPT_OFFSET        0xaa8
#define GC_USB_DIEPINT13_NYETINTRPT_LSB          0xe
#define GC_USB_DIEPINT13_NYETINTRPT_MASK         0x4000
#define GC_USB_DIEPINT13_NYETINTRPT_SIZE         0x1
#define GC_USB_DIEPINT13_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DIEPINT13_NYETINTRPT_OFFSET       0xaa8
#define GC_USB_DIEPTSIZ13_XFERSIZE_LSB           0x0
#define GC_USB_DIEPTSIZ13_XFERSIZE_MASK          0x7ffff
#define GC_USB_DIEPTSIZ13_XFERSIZE_SIZE          0x13
#define GC_USB_DIEPTSIZ13_XFERSIZE_DEFAULT       0x0
#define GC_USB_DIEPTSIZ13_XFERSIZE_OFFSET        0xab0
#define GC_USB_DIEPTSIZ13_PKTCNT_LSB             0x13
#define GC_USB_DIEPTSIZ13_PKTCNT_MASK            0x1ff80000
#define GC_USB_DIEPTSIZ13_PKTCNT_SIZE            0xa
#define GC_USB_DIEPTSIZ13_PKTCNT_DEFAULT         0x0
#define GC_USB_DIEPTSIZ13_PKTCNT_OFFSET          0xab0
#define GC_USB_DIEPTSIZ13_MC_LSB                 0x1d
#define GC_USB_DIEPTSIZ13_MC_MASK                0x60000000
#define GC_USB_DIEPTSIZ13_MC_SIZE                0x2
#define GC_USB_DIEPTSIZ13_MC_DEFAULT             0x0
#define GC_USB_DIEPTSIZ13_MC_OFFSET              0xab0
#define GC_USB_DIEPDMA13_DMAADDR_LSB             0x0
#define GC_USB_DIEPDMA13_DMAADDR_MASK            0xffffffff
#define GC_USB_DIEPDMA13_DMAADDR_SIZE            0x20
#define GC_USB_DIEPDMA13_DMAADDR_DEFAULT         0x0
#define GC_USB_DIEPDMA13_DMAADDR_OFFSET          0xab4
#define GC_USB_DTXFSTS13_INEPTXFSPCAVAIL_LSB     0x0
#define GC_USB_DTXFSTS13_INEPTXFSPCAVAIL_MASK    0xffff
#define GC_USB_DTXFSTS13_INEPTXFSPCAVAIL_SIZE    0x10
#define GC_USB_DTXFSTS13_INEPTXFSPCAVAIL_DEFAULT 0x0
#define GC_USB_DTXFSTS13_INEPTXFSPCAVAIL_OFFSET  0xab8
#define GC_USB_DIEPDMAB13_DMABUFFERADDR_LSB      0x0
#define GC_USB_DIEPDMAB13_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DIEPDMAB13_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DIEPDMAB13_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DIEPDMAB13_DMABUFFERADDR_OFFSET   0xabc
#define GC_USB_DIEPCTL14_MPS_LSB                 0x0
#define GC_USB_DIEPCTL14_MPS_MASK                0x7ff
#define GC_USB_DIEPCTL14_MPS_SIZE                0xb
#define GC_USB_DIEPCTL14_MPS_DEFAULT             0x0
#define GC_USB_DIEPCTL14_MPS_OFFSET              0xac0
#define GC_USB_DIEPCTL14_USBACTEP_LSB            0xf
#define GC_USB_DIEPCTL14_USBACTEP_MASK           0x8000
#define GC_USB_DIEPCTL14_USBACTEP_SIZE           0x1
#define GC_USB_DIEPCTL14_USBACTEP_DEFAULT        0x0
#define GC_USB_DIEPCTL14_USBACTEP_OFFSET         0xac0
#define GC_USB_DIEPCTL14_DPID_LSB                0x10
#define GC_USB_DIEPCTL14_DPID_MASK               0x10000
#define GC_USB_DIEPCTL14_DPID_SIZE               0x1
#define GC_USB_DIEPCTL14_DPID_DEFAULT            0x0
#define GC_USB_DIEPCTL14_DPID_OFFSET             0xac0
#define GC_USB_DIEPCTL14_NAKSTS_LSB              0x11
#define GC_USB_DIEPCTL14_NAKSTS_MASK             0x20000
#define GC_USB_DIEPCTL14_NAKSTS_SIZE             0x1
#define GC_USB_DIEPCTL14_NAKSTS_DEFAULT          0x0
#define GC_USB_DIEPCTL14_NAKSTS_OFFSET           0xac0
#define GC_USB_DIEPCTL14_EPTYPE_LSB              0x12
#define GC_USB_DIEPCTL14_EPTYPE_MASK             0xc0000
#define GC_USB_DIEPCTL14_EPTYPE_SIZE             0x2
#define GC_USB_DIEPCTL14_EPTYPE_DEFAULT          0x0
#define GC_USB_DIEPCTL14_EPTYPE_OFFSET           0xac0
#define GC_USB_DIEPCTL14_STALL_LSB               0x15
#define GC_USB_DIEPCTL14_STALL_MASK              0x200000
#define GC_USB_DIEPCTL14_STALL_SIZE              0x1
#define GC_USB_DIEPCTL14_STALL_DEFAULT           0x0
#define GC_USB_DIEPCTL14_STALL_OFFSET            0xac0
#define GC_USB_DIEPCTL14_TXFNUM_LSB              0x16
#define GC_USB_DIEPCTL14_TXFNUM_MASK             0x3c00000
#define GC_USB_DIEPCTL14_TXFNUM_SIZE             0x4
#define GC_USB_DIEPCTL14_TXFNUM_DEFAULT          0x0
#define GC_USB_DIEPCTL14_TXFNUM_OFFSET           0xac0
#define GC_USB_DIEPCTL14_CNAK_LSB                0x1a
#define GC_USB_DIEPCTL14_CNAK_MASK               0x4000000
#define GC_USB_DIEPCTL14_CNAK_SIZE               0x1
#define GC_USB_DIEPCTL14_CNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL14_CNAK_OFFSET             0xac0
#define GC_USB_DIEPCTL14_SNAK_LSB                0x1b
#define GC_USB_DIEPCTL14_SNAK_MASK               0x8000000
#define GC_USB_DIEPCTL14_SNAK_SIZE               0x1
#define GC_USB_DIEPCTL14_SNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL14_SNAK_OFFSET             0xac0
#define GC_USB_DIEPCTL14_SETD0PID_LSB            0x1c
#define GC_USB_DIEPCTL14_SETD0PID_MASK           0x10000000
#define GC_USB_DIEPCTL14_SETD0PID_SIZE           0x1
#define GC_USB_DIEPCTL14_SETD0PID_DEFAULT        0x0
#define GC_USB_DIEPCTL14_SETD0PID_OFFSET         0xac0
#define GC_USB_DIEPCTL14_SETD1PID_LSB            0x1d
#define GC_USB_DIEPCTL14_SETD1PID_MASK           0x20000000
#define GC_USB_DIEPCTL14_SETD1PID_SIZE           0x1
#define GC_USB_DIEPCTL14_SETD1PID_DEFAULT        0x0
#define GC_USB_DIEPCTL14_SETD1PID_OFFSET         0xac0
#define GC_USB_DIEPCTL14_EPDIS_LSB               0x1e
#define GC_USB_DIEPCTL14_EPDIS_MASK              0x40000000
#define GC_USB_DIEPCTL14_EPDIS_SIZE              0x1
#define GC_USB_DIEPCTL14_EPDIS_DEFAULT           0x0
#define GC_USB_DIEPCTL14_EPDIS_OFFSET            0xac0
#define GC_USB_DIEPCTL14_EPENA_LSB               0x1f
#define GC_USB_DIEPCTL14_EPENA_MASK              0x80000000
#define GC_USB_DIEPCTL14_EPENA_SIZE              0x1
#define GC_USB_DIEPCTL14_EPENA_DEFAULT           0x0
#define GC_USB_DIEPCTL14_EPENA_OFFSET            0xac0
#define GC_USB_DIEPINT14_XFERCOMPL_LSB           0x0
#define GC_USB_DIEPINT14_XFERCOMPL_MASK          0x1
#define GC_USB_DIEPINT14_XFERCOMPL_SIZE          0x1
#define GC_USB_DIEPINT14_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DIEPINT14_XFERCOMPL_OFFSET        0xac8
#define GC_USB_DIEPINT14_EPDISBLD_LSB            0x1
#define GC_USB_DIEPINT14_EPDISBLD_MASK           0x2
#define GC_USB_DIEPINT14_EPDISBLD_SIZE           0x1
#define GC_USB_DIEPINT14_EPDISBLD_DEFAULT        0x0
#define GC_USB_DIEPINT14_EPDISBLD_OFFSET         0xac8
#define GC_USB_DIEPINT14_AHBERR_LSB              0x2
#define GC_USB_DIEPINT14_AHBERR_MASK             0x4
#define GC_USB_DIEPINT14_AHBERR_SIZE             0x1
#define GC_USB_DIEPINT14_AHBERR_DEFAULT          0x0
#define GC_USB_DIEPINT14_AHBERR_OFFSET           0xac8
#define GC_USB_DIEPINT14_TIMEOUT_LSB             0x3
#define GC_USB_DIEPINT14_TIMEOUT_MASK            0x8
#define GC_USB_DIEPINT14_TIMEOUT_SIZE            0x1
#define GC_USB_DIEPINT14_TIMEOUT_DEFAULT         0x0
#define GC_USB_DIEPINT14_TIMEOUT_OFFSET          0xac8
#define GC_USB_DIEPINT14_INTKNTXFEMP_LSB         0x4
#define GC_USB_DIEPINT14_INTKNTXFEMP_MASK        0x10
#define GC_USB_DIEPINT14_INTKNTXFEMP_SIZE        0x1
#define GC_USB_DIEPINT14_INTKNTXFEMP_DEFAULT     0x0
#define GC_USB_DIEPINT14_INTKNTXFEMP_OFFSET      0xac8
#define GC_USB_DIEPINT14_INTKNEPMIS_LSB          0x5
#define GC_USB_DIEPINT14_INTKNEPMIS_MASK         0x20
#define GC_USB_DIEPINT14_INTKNEPMIS_SIZE         0x1
#define GC_USB_DIEPINT14_INTKNEPMIS_DEFAULT      0x0
#define GC_USB_DIEPINT14_INTKNEPMIS_OFFSET       0xac8
#define GC_USB_DIEPINT14_INEPNAKEFF_LSB          0x6
#define GC_USB_DIEPINT14_INEPNAKEFF_MASK         0x40
#define GC_USB_DIEPINT14_INEPNAKEFF_SIZE         0x1
#define GC_USB_DIEPINT14_INEPNAKEFF_DEFAULT      0x0
#define GC_USB_DIEPINT14_INEPNAKEFF_OFFSET       0xac8
#define GC_USB_DIEPINT14_TXFEMP_LSB              0x7
#define GC_USB_DIEPINT14_TXFEMP_MASK             0x80
#define GC_USB_DIEPINT14_TXFEMP_SIZE             0x1
#define GC_USB_DIEPINT14_TXFEMP_DEFAULT          0x0
#define GC_USB_DIEPINT14_TXFEMP_OFFSET           0xac8
#define GC_USB_DIEPINT14_TXFIFOUNDRN_LSB         0x8
#define GC_USB_DIEPINT14_TXFIFOUNDRN_MASK        0x100
#define GC_USB_DIEPINT14_TXFIFOUNDRN_SIZE        0x1
#define GC_USB_DIEPINT14_TXFIFOUNDRN_DEFAULT     0x0
#define GC_USB_DIEPINT14_TXFIFOUNDRN_OFFSET      0xac8
#define GC_USB_DIEPINT14_BNAINTR_LSB             0x9
#define GC_USB_DIEPINT14_BNAINTR_MASK            0x200
#define GC_USB_DIEPINT14_BNAINTR_SIZE            0x1
#define GC_USB_DIEPINT14_BNAINTR_DEFAULT         0x0
#define GC_USB_DIEPINT14_BNAINTR_OFFSET          0xac8
#define GC_USB_DIEPINT14_PKTDRPSTS_LSB           0xb
#define GC_USB_DIEPINT14_PKTDRPSTS_MASK          0x800
#define GC_USB_DIEPINT14_PKTDRPSTS_SIZE          0x1
#define GC_USB_DIEPINT14_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DIEPINT14_PKTDRPSTS_OFFSET        0xac8
#define GC_USB_DIEPINT14_BBLEERR_LSB             0xc
#define GC_USB_DIEPINT14_BBLEERR_MASK            0x1000
#define GC_USB_DIEPINT14_BBLEERR_SIZE            0x1
#define GC_USB_DIEPINT14_BBLEERR_DEFAULT         0x0
#define GC_USB_DIEPINT14_BBLEERR_OFFSET          0xac8
#define GC_USB_DIEPINT14_NAKINTRPT_LSB           0xd
#define GC_USB_DIEPINT14_NAKINTRPT_MASK          0x2000
#define GC_USB_DIEPINT14_NAKINTRPT_SIZE          0x1
#define GC_USB_DIEPINT14_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT14_NAKINTRPT_OFFSET        0xac8
#define GC_USB_DIEPINT14_NYETINTRPT_LSB          0xe
#define GC_USB_DIEPINT14_NYETINTRPT_MASK         0x4000
#define GC_USB_DIEPINT14_NYETINTRPT_SIZE         0x1
#define GC_USB_DIEPINT14_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DIEPINT14_NYETINTRPT_OFFSET       0xac8
#define GC_USB_DIEPTSIZ14_XFERSIZE_LSB           0x0
#define GC_USB_DIEPTSIZ14_XFERSIZE_MASK          0x7ffff
#define GC_USB_DIEPTSIZ14_XFERSIZE_SIZE          0x13
#define GC_USB_DIEPTSIZ14_XFERSIZE_DEFAULT       0x0
#define GC_USB_DIEPTSIZ14_XFERSIZE_OFFSET        0xad0
#define GC_USB_DIEPTSIZ14_PKTCNT_LSB             0x13
#define GC_USB_DIEPTSIZ14_PKTCNT_MASK            0x1ff80000
#define GC_USB_DIEPTSIZ14_PKTCNT_SIZE            0xa
#define GC_USB_DIEPTSIZ14_PKTCNT_DEFAULT         0x0
#define GC_USB_DIEPTSIZ14_PKTCNT_OFFSET          0xad0
#define GC_USB_DIEPTSIZ14_MC_LSB                 0x1d
#define GC_USB_DIEPTSIZ14_MC_MASK                0x60000000
#define GC_USB_DIEPTSIZ14_MC_SIZE                0x2
#define GC_USB_DIEPTSIZ14_MC_DEFAULT             0x0
#define GC_USB_DIEPTSIZ14_MC_OFFSET              0xad0
#define GC_USB_DIEPDMA14_DMAADDR_LSB             0x0
#define GC_USB_DIEPDMA14_DMAADDR_MASK            0xffffffff
#define GC_USB_DIEPDMA14_DMAADDR_SIZE            0x20
#define GC_USB_DIEPDMA14_DMAADDR_DEFAULT         0x0
#define GC_USB_DIEPDMA14_DMAADDR_OFFSET          0xad4
#define GC_USB_DTXFSTS14_INEPTXFSPCAVAIL_LSB     0x0
#define GC_USB_DTXFSTS14_INEPTXFSPCAVAIL_MASK    0xffff
#define GC_USB_DTXFSTS14_INEPTXFSPCAVAIL_SIZE    0x10
#define GC_USB_DTXFSTS14_INEPTXFSPCAVAIL_DEFAULT 0x0
#define GC_USB_DTXFSTS14_INEPTXFSPCAVAIL_OFFSET  0xad8
#define GC_USB_DIEPDMAB14_DMABUFFERADDR_LSB      0x0
#define GC_USB_DIEPDMAB14_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DIEPDMAB14_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DIEPDMAB14_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DIEPDMAB14_DMABUFFERADDR_OFFSET   0xadc
#define GC_USB_DIEPCTL15_MPS_LSB                 0x0
#define GC_USB_DIEPCTL15_MPS_MASK                0x7ff
#define GC_USB_DIEPCTL15_MPS_SIZE                0xb
#define GC_USB_DIEPCTL15_MPS_DEFAULT             0x0
#define GC_USB_DIEPCTL15_MPS_OFFSET              0xae0
#define GC_USB_DIEPCTL15_USBACTEP_LSB            0xf
#define GC_USB_DIEPCTL15_USBACTEP_MASK           0x8000
#define GC_USB_DIEPCTL15_USBACTEP_SIZE           0x1
#define GC_USB_DIEPCTL15_USBACTEP_DEFAULT        0x0
#define GC_USB_DIEPCTL15_USBACTEP_OFFSET         0xae0
#define GC_USB_DIEPCTL15_DPID_LSB                0x10
#define GC_USB_DIEPCTL15_DPID_MASK               0x10000
#define GC_USB_DIEPCTL15_DPID_SIZE               0x1
#define GC_USB_DIEPCTL15_DPID_DEFAULT            0x0
#define GC_USB_DIEPCTL15_DPID_OFFSET             0xae0
#define GC_USB_DIEPCTL15_NAKSTS_LSB              0x11
#define GC_USB_DIEPCTL15_NAKSTS_MASK             0x20000
#define GC_USB_DIEPCTL15_NAKSTS_SIZE             0x1
#define GC_USB_DIEPCTL15_NAKSTS_DEFAULT          0x0
#define GC_USB_DIEPCTL15_NAKSTS_OFFSET           0xae0
#define GC_USB_DIEPCTL15_EPTYPE_LSB              0x12
#define GC_USB_DIEPCTL15_EPTYPE_MASK             0xc0000
#define GC_USB_DIEPCTL15_EPTYPE_SIZE             0x2
#define GC_USB_DIEPCTL15_EPTYPE_DEFAULT          0x0
#define GC_USB_DIEPCTL15_EPTYPE_OFFSET           0xae0
#define GC_USB_DIEPCTL15_STALL_LSB               0x15
#define GC_USB_DIEPCTL15_STALL_MASK              0x200000
#define GC_USB_DIEPCTL15_STALL_SIZE              0x1
#define GC_USB_DIEPCTL15_STALL_DEFAULT           0x0
#define GC_USB_DIEPCTL15_STALL_OFFSET            0xae0
#define GC_USB_DIEPCTL15_TXFNUM_LSB              0x16
#define GC_USB_DIEPCTL15_TXFNUM_MASK             0x3c00000
#define GC_USB_DIEPCTL15_TXFNUM_SIZE             0x4
#define GC_USB_DIEPCTL15_TXFNUM_DEFAULT          0x0
#define GC_USB_DIEPCTL15_TXFNUM_OFFSET           0xae0
#define GC_USB_DIEPCTL15_CNAK_LSB                0x1a
#define GC_USB_DIEPCTL15_CNAK_MASK               0x4000000
#define GC_USB_DIEPCTL15_CNAK_SIZE               0x1
#define GC_USB_DIEPCTL15_CNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL15_CNAK_OFFSET             0xae0
#define GC_USB_DIEPCTL15_SNAK_LSB                0x1b
#define GC_USB_DIEPCTL15_SNAK_MASK               0x8000000
#define GC_USB_DIEPCTL15_SNAK_SIZE               0x1
#define GC_USB_DIEPCTL15_SNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL15_SNAK_OFFSET             0xae0
#define GC_USB_DIEPCTL15_SETD0PID_LSB            0x1c
#define GC_USB_DIEPCTL15_SETD0PID_MASK           0x10000000
#define GC_USB_DIEPCTL15_SETD0PID_SIZE           0x1
#define GC_USB_DIEPCTL15_SETD0PID_DEFAULT        0x0
#define GC_USB_DIEPCTL15_SETD0PID_OFFSET         0xae0
#define GC_USB_DIEPCTL15_SETD1PID_LSB            0x1d
#define GC_USB_DIEPCTL15_SETD1PID_MASK           0x20000000
#define GC_USB_DIEPCTL15_SETD1PID_SIZE           0x1
#define GC_USB_DIEPCTL15_SETD1PID_DEFAULT        0x0
#define GC_USB_DIEPCTL15_SETD1PID_OFFSET         0xae0
#define GC_USB_DIEPCTL15_EPDIS_LSB               0x1e
#define GC_USB_DIEPCTL15_EPDIS_MASK              0x40000000
#define GC_USB_DIEPCTL15_EPDIS_SIZE              0x1
#define GC_USB_DIEPCTL15_EPDIS_DEFAULT           0x0
#define GC_USB_DIEPCTL15_EPDIS_OFFSET            0xae0
#define GC_USB_DIEPCTL15_EPENA_LSB               0x1f
#define GC_USB_DIEPCTL15_EPENA_MASK              0x80000000
#define GC_USB_DIEPCTL15_EPENA_SIZE              0x1
