FrameworkComputer/EmbeddedController/chip/stm32/usb_dwc_registers.h
#define GC_USB_DOEPCTL2_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL2_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL2_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL2_CNAK_OFFSET              0xb40
#define GC_USB_DOEPCTL2_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL2_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL2_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL2_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL2_SNAK_OFFSET              0xb40
#define GC_USB_DOEPCTL2_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL2_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL2_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL2_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL2_SETD0PID_OFFSET          0xb40
#define GC_USB_DOEPCTL2_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL2_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL2_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL2_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL2_SETD1PID_OFFSET          0xb40
#define GC_USB_DOEPCTL2_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL2_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL2_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL2_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL2_EPDIS_OFFSET             0xb40
#define GC_USB_DOEPCTL2_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL2_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL2_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL2_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL2_EPENA_OFFSET             0xb40
#define GC_USB_DOEPINT2_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT2_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT2_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT2_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT2_XFERCOMPL_OFFSET         0xb48
#define GC_USB_DOEPINT2_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT2_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT2_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT2_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT2_EPDISBLD_OFFSET          0xb48
#define GC_USB_DOEPINT2_AHBERR_LSB               0x2
#define GC_USB_DOEPINT2_AHBERR_MASK              0x4
#define GC_USB_DOEPINT2_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT2_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT2_AHBERR_OFFSET            0xb48
#define GC_USB_DOEPINT2_SETUP_LSB                0x3
#define GC_USB_DOEPINT2_SETUP_MASK               0x8
#define GC_USB_DOEPINT2_SETUP_SIZE               0x1
#define GC_USB_DOEPINT2_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT2_SETUP_OFFSET             0xb48
#define GC_USB_DOEPINT2_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT2_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT2_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT2_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT2_OUTTKNEPDIS_OFFSET       0xb48
#define GC_USB_DOEPINT2_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT2_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT2_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT2_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT2_STSPHSERCVD_OFFSET       0xb48
#define GC_USB_DOEPINT2_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT2_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT2_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT2_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT2_BACK2BACKSETUP_OFFSET    0xb48
#define GC_USB_DOEPINT2_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT2_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT2_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT2_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT2_OUTPKTERR_OFFSET         0xb48
#define GC_USB_DOEPINT2_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT2_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT2_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT2_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT2_BNAINTR_OFFSET           0xb48
#define GC_USB_DOEPINT2_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT2_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT2_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT2_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT2_PKTDRPSTS_OFFSET         0xb48
#define GC_USB_DOEPINT2_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT2_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT2_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT2_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT2_BBLEERR_OFFSET           0xb48
#define GC_USB_DOEPINT2_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT2_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT2_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT2_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT2_NAKINTRPT_OFFSET         0xb48
#define GC_USB_DOEPINT2_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT2_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT2_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT2_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT2_NYETINTRPT_OFFSET        0xb48
#define GC_USB_DOEPINT2_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT2_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT2_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT2_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT2_STUPPKTRCVD_OFFSET       0xb48
#define GC_USB_DOEPTSIZ2_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ2_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ2_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ2_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ2_XFERSIZE_OFFSET         0xb50
#define GC_USB_DOEPTSIZ2_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ2_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ2_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ2_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ2_PKTCNT_OFFSET           0xb50
#define GC_USB_DOEPTSIZ2_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ2_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ2_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ2_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ2_RXDPID_OFFSET           0xb50
#define GC_USB_DOEPDMA2_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA2_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA2_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA2_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA2_DMAADDR_OFFSET           0xb54
#define GC_USB_DOEPDMAB2_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB2_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB2_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB2_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB2_DMABUFFERADDR_OFFSET    0xb5c
#define GC_USB_DOEPCTL3_MPS_LSB                  0x0
#define GC_USB_DOEPCTL3_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL3_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL3_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL3_MPS_OFFSET               0xb60
#define GC_USB_DOEPCTL3_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL3_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL3_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL3_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL3_USBACTEP_OFFSET          0xb60
#define GC_USB_DOEPCTL3_DPID_LSB                 0x10
#define GC_USB_DOEPCTL3_DPID_MASK                0x10000
#define GC_USB_DOEPCTL3_DPID_SIZE                0x1
#define GC_USB_DOEPCTL3_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL3_DPID_OFFSET              0xb60
#define GC_USB_DOEPCTL3_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL3_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL3_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL3_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL3_NAKSTS_OFFSET            0xb60
#define GC_USB_DOEPCTL3_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL3_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL3_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL3_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL3_EPTYPE_OFFSET            0xb60
#define GC_USB_DOEPCTL3_SNP_LSB                  0x14
#define GC_USB_DOEPCTL3_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL3_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL3_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL3_SNP_OFFSET               0xb60
#define GC_USB_DOEPCTL3_STALL_LSB                0x15
#define GC_USB_DOEPCTL3_STALL_MASK               0x200000
#define GC_USB_DOEPCTL3_STALL_SIZE               0x1
#define GC_USB_DOEPCTL3_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL3_STALL_OFFSET             0xb60
#define GC_USB_DOEPCTL3_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL3_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL3_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL3_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL3_CNAK_OFFSET              0xb60
#define GC_USB_DOEPCTL3_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL3_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL3_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL3_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL3_SNAK_OFFSET              0xb60
#define GC_USB_DOEPCTL3_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL3_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL3_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL3_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL3_SETD0PID_OFFSET          0xb60
#define GC_USB_DOEPCTL3_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL3_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL3_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL3_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL3_SETD1PID_OFFSET          0xb60
#define GC_USB_DOEPCTL3_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL3_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL3_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL3_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL3_EPDIS_OFFSET             0xb60
#define GC_USB_DOEPCTL3_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL3_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL3_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL3_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL3_EPENA_OFFSET             0xb60
#define GC_USB_DOEPINT3_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT3_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT3_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT3_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT3_XFERCOMPL_OFFSET         0xb68
#define GC_USB_DOEPINT3_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT3_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT3_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT3_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT3_EPDISBLD_OFFSET          0xb68
#define GC_USB_DOEPINT3_AHBERR_LSB               0x2
#define GC_USB_DOEPINT3_AHBERR_MASK              0x4
#define GC_USB_DOEPINT3_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT3_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT3_AHBERR_OFFSET            0xb68
#define GC_USB_DOEPINT3_SETUP_LSB                0x3
#define GC_USB_DOEPINT3_SETUP_MASK               0x8
#define GC_USB_DOEPINT3_SETUP_SIZE               0x1
#define GC_USB_DOEPINT3_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT3_SETUP_OFFSET             0xb68
#define GC_USB_DOEPINT3_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT3_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT3_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT3_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT3_OUTTKNEPDIS_OFFSET       0xb68
#define GC_USB_DOEPINT3_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT3_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT3_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT3_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT3_STSPHSERCVD_OFFSET       0xb68
#define GC_USB_DOEPINT3_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT3_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT3_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT3_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT3_BACK2BACKSETUP_OFFSET    0xb68
#define GC_USB_DOEPINT3_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT3_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT3_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT3_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT3_OUTPKTERR_OFFSET         0xb68
#define GC_USB_DOEPINT3_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT3_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT3_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT3_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT3_BNAINTR_OFFSET           0xb68
#define GC_USB_DOEPINT3_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT3_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT3_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT3_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT3_PKTDRPSTS_OFFSET         0xb68
#define GC_USB_DOEPINT3_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT3_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT3_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT3_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT3_BBLEERR_OFFSET           0xb68
#define GC_USB_DOEPINT3_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT3_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT3_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT3_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT3_NAKINTRPT_OFFSET         0xb68
#define GC_USB_DOEPINT3_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT3_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT3_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT3_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT3_NYETINTRPT_OFFSET        0xb68
#define GC_USB_DOEPINT3_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT3_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT3_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT3_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT3_STUPPKTRCVD_OFFSET       0xb68
#define GC_USB_DOEPTSIZ3_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ3_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ3_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ3_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ3_XFERSIZE_OFFSET         0xb70
#define GC_USB_DOEPTSIZ3_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ3_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ3_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ3_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ3_PKTCNT_OFFSET           0xb70
#define GC_USB_DOEPTSIZ3_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ3_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ3_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ3_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ3_RXDPID_OFFSET           0xb70
#define GC_USB_DOEPDMA3_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA3_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA3_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA3_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA3_DMAADDR_OFFSET           0xb74
#define GC_USB_DOEPDMAB3_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB3_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB3_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB3_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB3_DMABUFFERADDR_OFFSET    0xb7c
#define GC_USB_DOEPCTL4_MPS_LSB                  0x0
#define GC_USB_DOEPCTL4_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL4_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL4_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL4_MPS_OFFSET               0xb80
#define GC_USB_DOEPCTL4_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL4_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL4_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL4_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL4_USBACTEP_OFFSET          0xb80
#define GC_USB_DOEPCTL4_DPID_LSB                 0x10
#define GC_USB_DOEPCTL4_DPID_MASK                0x10000
#define GC_USB_DOEPCTL4_DPID_SIZE                0x1
#define GC_USB_DOEPCTL4_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL4_DPID_OFFSET              0xb80
#define GC_USB_DOEPCTL4_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL4_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL4_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL4_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL4_NAKSTS_OFFSET            0xb80
#define GC_USB_DOEPCTL4_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL4_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL4_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL4_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL4_EPTYPE_OFFSET            0xb80
#define GC_USB_DOEPCTL4_SNP_LSB                  0x14
#define GC_USB_DOEPCTL4_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL4_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL4_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL4_SNP_OFFSET               0xb80
#define GC_USB_DOEPCTL4_STALL_LSB                0x15
#define GC_USB_DOEPCTL4_STALL_MASK               0x200000
#define GC_USB_DOEPCTL4_STALL_SIZE               0x1
#define GC_USB_DOEPCTL4_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL4_STALL_OFFSET             0xb80
#define GC_USB_DOEPCTL4_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL4_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL4_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL4_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL4_CNAK_OFFSET              0xb80
#define GC_USB_DOEPCTL4_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL4_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL4_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL4_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL4_SNAK_OFFSET              0xb80
#define GC_USB_DOEPCTL4_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL4_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL4_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL4_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL4_SETD0PID_OFFSET          0xb80
#define GC_USB_DOEPCTL4_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL4_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL4_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL4_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL4_SETD1PID_OFFSET          0xb80
#define GC_USB_DOEPCTL4_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL4_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL4_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL4_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL4_EPDIS_OFFSET             0xb80
#define GC_USB_DOEPCTL4_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL4_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL4_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL4_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL4_EPENA_OFFSET             0xb80
#define GC_USB_DOEPINT4_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT4_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT4_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT4_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT4_XFERCOMPL_OFFSET         0xb88
#define GC_USB_DOEPINT4_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT4_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT4_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT4_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT4_EPDISBLD_OFFSET          0xb88
#define GC_USB_DOEPINT4_AHBERR_LSB               0x2
#define GC_USB_DOEPINT4_AHBERR_MASK              0x4
#define GC_USB_DOEPINT4_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT4_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT4_AHBERR_OFFSET            0xb88
#define GC_USB_DOEPINT4_SETUP_LSB                0x3
#define GC_USB_DOEPINT4_SETUP_MASK               0x8
#define GC_USB_DOEPINT4_SETUP_SIZE               0x1
#define GC_USB_DOEPINT4_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT4_SETUP_OFFSET             0xb88
#define GC_USB_DOEPINT4_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT4_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT4_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT4_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT4_OUTTKNEPDIS_OFFSET       0xb88
#define GC_USB_DOEPINT4_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT4_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT4_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT4_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT4_STSPHSERCVD_OFFSET       0xb88
#define GC_USB_DOEPINT4_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT4_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT4_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT4_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT4_BACK2BACKSETUP_OFFSET    0xb88
#define GC_USB_DOEPINT4_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT4_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT4_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT4_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT4_OUTPKTERR_OFFSET         0xb88
#define GC_USB_DOEPINT4_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT4_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT4_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT4_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT4_BNAINTR_OFFSET           0xb88
#define GC_USB_DOEPINT4_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT4_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT4_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT4_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT4_PKTDRPSTS_OFFSET         0xb88
#define GC_USB_DOEPINT4_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT4_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT4_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT4_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT4_BBLEERR_OFFSET           0xb88
#define GC_USB_DOEPINT4_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT4_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT4_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT4_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT4_NAKINTRPT_OFFSET         0xb88
#define GC_USB_DOEPINT4_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT4_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT4_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT4_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT4_NYETINTRPT_OFFSET        0xb88
#define GC_USB_DOEPINT4_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT4_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT4_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT4_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT4_STUPPKTRCVD_OFFSET       0xb88
#define GC_USB_DOEPTSIZ4_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ4_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ4_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ4_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ4_XFERSIZE_OFFSET         0xb90
#define GC_USB_DOEPTSIZ4_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ4_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ4_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ4_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ4_PKTCNT_OFFSET           0xb90
#define GC_USB_DOEPTSIZ4_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ4_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ4_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ4_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ4_RXDPID_OFFSET           0xb90
#define GC_USB_DOEPDMA4_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA4_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA4_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA4_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA4_DMAADDR_OFFSET           0xb94
#define GC_USB_DOEPDMAB4_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB4_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB4_DMABUFFERADDR_SIZE      0x20
