FrameworkComputer/EmbeddedController/chip/stm32/usb_dwc_registers.h
#define GC_USB_DOEPINT10_SETUP_SIZE              0x1
#define GC_USB_DOEPINT10_SETUP_DEFAULT           0x0
#define GC_USB_DOEPINT10_SETUP_OFFSET            0xc48
#define GC_USB_DOEPINT10_OUTTKNEPDIS_LSB         0x4
#define GC_USB_DOEPINT10_OUTTKNEPDIS_MASK        0x10
#define GC_USB_DOEPINT10_OUTTKNEPDIS_SIZE        0x1
#define GC_USB_DOEPINT10_OUTTKNEPDIS_DEFAULT     0x0
#define GC_USB_DOEPINT10_OUTTKNEPDIS_OFFSET      0xc48
#define GC_USB_DOEPINT10_STSPHSERCVD_LSB         0x5
#define GC_USB_DOEPINT10_STSPHSERCVD_MASK        0x20
#define GC_USB_DOEPINT10_STSPHSERCVD_SIZE        0x1
#define GC_USB_DOEPINT10_STSPHSERCVD_DEFAULT     0x0
#define GC_USB_DOEPINT10_STSPHSERCVD_OFFSET      0xc48
#define GC_USB_DOEPINT10_BACK2BACKSETUP_LSB      0x6
#define GC_USB_DOEPINT10_BACK2BACKSETUP_MASK     0x40
#define GC_USB_DOEPINT10_BACK2BACKSETUP_SIZE     0x1
#define GC_USB_DOEPINT10_BACK2BACKSETUP_DEFAULT  0x0
#define GC_USB_DOEPINT10_BACK2BACKSETUP_OFFSET   0xc48
#define GC_USB_DOEPINT10_OUTPKTERR_LSB           0x8
#define GC_USB_DOEPINT10_OUTPKTERR_MASK          0x100
#define GC_USB_DOEPINT10_OUTPKTERR_SIZE          0x1
#define GC_USB_DOEPINT10_OUTPKTERR_DEFAULT       0x0
#define GC_USB_DOEPINT10_OUTPKTERR_OFFSET        0xc48
#define GC_USB_DOEPINT10_BNAINTR_LSB             0x9
#define GC_USB_DOEPINT10_BNAINTR_MASK            0x200
#define GC_USB_DOEPINT10_BNAINTR_SIZE            0x1
#define GC_USB_DOEPINT10_BNAINTR_DEFAULT         0x0
#define GC_USB_DOEPINT10_BNAINTR_OFFSET          0xc48
#define GC_USB_DOEPINT10_PKTDRPSTS_LSB           0xb
#define GC_USB_DOEPINT10_PKTDRPSTS_MASK          0x800
#define GC_USB_DOEPINT10_PKTDRPSTS_SIZE          0x1
#define GC_USB_DOEPINT10_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DOEPINT10_PKTDRPSTS_OFFSET        0xc48
#define GC_USB_DOEPINT10_BBLEERR_LSB             0xc
#define GC_USB_DOEPINT10_BBLEERR_MASK            0x1000
#define GC_USB_DOEPINT10_BBLEERR_SIZE            0x1
#define GC_USB_DOEPINT10_BBLEERR_DEFAULT         0x0
#define GC_USB_DOEPINT10_BBLEERR_OFFSET          0xc48
#define GC_USB_DOEPINT10_NAKINTRPT_LSB           0xd
#define GC_USB_DOEPINT10_NAKINTRPT_MASK          0x2000
#define GC_USB_DOEPINT10_NAKINTRPT_SIZE          0x1
#define GC_USB_DOEPINT10_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT10_NAKINTRPT_OFFSET        0xc48
#define GC_USB_DOEPINT10_NYETINTRPT_LSB          0xe
#define GC_USB_DOEPINT10_NYETINTRPT_MASK         0x4000
#define GC_USB_DOEPINT10_NYETINTRPT_SIZE         0x1
#define GC_USB_DOEPINT10_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DOEPINT10_NYETINTRPT_OFFSET       0xc48
#define GC_USB_DOEPINT10_STUPPKTRCVD_LSB         0xf
#define GC_USB_DOEPINT10_STUPPKTRCVD_MASK        0x8000
#define GC_USB_DOEPINT10_STUPPKTRCVD_SIZE        0x1
#define GC_USB_DOEPINT10_STUPPKTRCVD_DEFAULT     0x0
#define GC_USB_DOEPINT10_STUPPKTRCVD_OFFSET      0xc48
#define GC_USB_DOEPTSIZ10_XFERSIZE_LSB           0x0
#define GC_USB_DOEPTSIZ10_XFERSIZE_MASK          0x7ffff
#define GC_USB_DOEPTSIZ10_XFERSIZE_SIZE          0x13
#define GC_USB_DOEPTSIZ10_XFERSIZE_DEFAULT       0x0
#define GC_USB_DOEPTSIZ10_XFERSIZE_OFFSET        0xc50
#define GC_USB_DOEPTSIZ10_PKTCNT_LSB             0x13
#define GC_USB_DOEPTSIZ10_PKTCNT_MASK            0x1ff80000
#define GC_USB_DOEPTSIZ10_PKTCNT_SIZE            0xa
#define GC_USB_DOEPTSIZ10_PKTCNT_DEFAULT         0x0
#define GC_USB_DOEPTSIZ10_PKTCNT_OFFSET          0xc50
#define GC_USB_DOEPTSIZ10_RXDPID_LSB             0x1d
#define GC_USB_DOEPTSIZ10_RXDPID_MASK            0x60000000
#define GC_USB_DOEPTSIZ10_RXDPID_SIZE            0x2
#define GC_USB_DOEPTSIZ10_RXDPID_DEFAULT         0x0
#define GC_USB_DOEPTSIZ10_RXDPID_OFFSET          0xc50
#define GC_USB_DOEPDMA10_DMAADDR_LSB             0x0
#define GC_USB_DOEPDMA10_DMAADDR_MASK            0xffffffff
#define GC_USB_DOEPDMA10_DMAADDR_SIZE            0x20
#define GC_USB_DOEPDMA10_DMAADDR_DEFAULT         0x0
#define GC_USB_DOEPDMA10_DMAADDR_OFFSET          0xc54
#define GC_USB_DOEPDMAB10_DMABUFFERADDR_LSB      0x0
#define GC_USB_DOEPDMAB10_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DOEPDMAB10_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DOEPDMAB10_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DOEPDMAB10_DMABUFFERADDR_OFFSET   0xc5c
#define GC_USB_DOEPCTL11_MPS_LSB                 0x0
#define GC_USB_DOEPCTL11_MPS_MASK                0x7ff
#define GC_USB_DOEPCTL11_MPS_SIZE                0xb
#define GC_USB_DOEPCTL11_MPS_DEFAULT             0x0
#define GC_USB_DOEPCTL11_MPS_OFFSET              0xc60
#define GC_USB_DOEPCTL11_USBACTEP_LSB            0xf
#define GC_USB_DOEPCTL11_USBACTEP_MASK           0x8000
#define GC_USB_DOEPCTL11_USBACTEP_SIZE           0x1
#define GC_USB_DOEPCTL11_USBACTEP_DEFAULT        0x0
#define GC_USB_DOEPCTL11_USBACTEP_OFFSET         0xc60
#define GC_USB_DOEPCTL11_DPID_LSB                0x10
#define GC_USB_DOEPCTL11_DPID_MASK               0x10000
#define GC_USB_DOEPCTL11_DPID_SIZE               0x1
#define GC_USB_DOEPCTL11_DPID_DEFAULT            0x0
#define GC_USB_DOEPCTL11_DPID_OFFSET             0xc60
#define GC_USB_DOEPCTL11_NAKSTS_LSB              0x11
#define GC_USB_DOEPCTL11_NAKSTS_MASK             0x20000
#define GC_USB_DOEPCTL11_NAKSTS_SIZE             0x1
#define GC_USB_DOEPCTL11_NAKSTS_DEFAULT          0x0
#define GC_USB_DOEPCTL11_NAKSTS_OFFSET           0xc60
#define GC_USB_DOEPCTL11_EPTYPE_LSB              0x12
#define GC_USB_DOEPCTL11_EPTYPE_MASK             0xc0000
#define GC_USB_DOEPCTL11_EPTYPE_SIZE             0x2
#define GC_USB_DOEPCTL11_EPTYPE_DEFAULT          0x0
#define GC_USB_DOEPCTL11_EPTYPE_OFFSET           0xc60
#define GC_USB_DOEPCTL11_SNP_LSB                 0x14
#define GC_USB_DOEPCTL11_SNP_MASK                0x100000
#define GC_USB_DOEPCTL11_SNP_SIZE                0x1
#define GC_USB_DOEPCTL11_SNP_DEFAULT             0x0
#define GC_USB_DOEPCTL11_SNP_OFFSET              0xc60
#define GC_USB_DOEPCTL11_STALL_LSB               0x15
#define GC_USB_DOEPCTL11_STALL_MASK              0x200000
#define GC_USB_DOEPCTL11_STALL_SIZE              0x1
#define GC_USB_DOEPCTL11_STALL_DEFAULT           0x0
#define GC_USB_DOEPCTL11_STALL_OFFSET            0xc60
#define GC_USB_DOEPCTL11_CNAK_LSB                0x1a
#define GC_USB_DOEPCTL11_CNAK_MASK               0x4000000
#define GC_USB_DOEPCTL11_CNAK_SIZE               0x1
#define GC_USB_DOEPCTL11_CNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL11_CNAK_OFFSET             0xc60
#define GC_USB_DOEPCTL11_SNAK_LSB                0x1b
#define GC_USB_DOEPCTL11_SNAK_MASK               0x8000000
#define GC_USB_DOEPCTL11_SNAK_SIZE               0x1
#define GC_USB_DOEPCTL11_SNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL11_SNAK_OFFSET             0xc60
#define GC_USB_DOEPCTL11_SETD0PID_LSB            0x1c
#define GC_USB_DOEPCTL11_SETD0PID_MASK           0x10000000
#define GC_USB_DOEPCTL11_SETD0PID_SIZE           0x1
#define GC_USB_DOEPCTL11_SETD0PID_DEFAULT        0x0
#define GC_USB_DOEPCTL11_SETD0PID_OFFSET         0xc60
#define GC_USB_DOEPCTL11_SETD1PID_LSB            0x1d
#define GC_USB_DOEPCTL11_SETD1PID_MASK           0x20000000
#define GC_USB_DOEPCTL11_SETD1PID_SIZE           0x1
#define GC_USB_DOEPCTL11_SETD1PID_DEFAULT        0x0
#define GC_USB_DOEPCTL11_SETD1PID_OFFSET         0xc60
#define GC_USB_DOEPCTL11_EPDIS_LSB               0x1e
#define GC_USB_DOEPCTL11_EPDIS_MASK              0x40000000
#define GC_USB_DOEPCTL11_EPDIS_SIZE              0x1
#define GC_USB_DOEPCTL11_EPDIS_DEFAULT           0x0
#define GC_USB_DOEPCTL11_EPDIS_OFFSET            0xc60
#define GC_USB_DOEPCTL11_EPENA_LSB               0x1f
#define GC_USB_DOEPCTL11_EPENA_MASK              0x80000000
#define GC_USB_DOEPCTL11_EPENA_SIZE              0x1
#define GC_USB_DOEPCTL11_EPENA_DEFAULT           0x0
#define GC_USB_DOEPCTL11_EPENA_OFFSET            0xc60
#define GC_USB_DOEPINT11_XFERCOMPL_LSB           0x0
#define GC_USB_DOEPINT11_XFERCOMPL_MASK          0x1
#define GC_USB_DOEPINT11_XFERCOMPL_SIZE          0x1
#define GC_USB_DOEPINT11_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DOEPINT11_XFERCOMPL_OFFSET        0xc68
#define GC_USB_DOEPINT11_EPDISBLD_LSB            0x1
#define GC_USB_DOEPINT11_EPDISBLD_MASK           0x2
#define GC_USB_DOEPINT11_EPDISBLD_SIZE           0x1
#define GC_USB_DOEPINT11_EPDISBLD_DEFAULT        0x0
#define GC_USB_DOEPINT11_EPDISBLD_OFFSET         0xc68
#define GC_USB_DOEPINT11_AHBERR_LSB              0x2
#define GC_USB_DOEPINT11_AHBERR_MASK             0x4
#define GC_USB_DOEPINT11_AHBERR_SIZE             0x1
#define GC_USB_DOEPINT11_AHBERR_DEFAULT          0x0
#define GC_USB_DOEPINT11_AHBERR_OFFSET           0xc68
#define GC_USB_DOEPINT11_SETUP_LSB               0x3
#define GC_USB_DOEPINT11_SETUP_MASK              0x8
#define GC_USB_DOEPINT11_SETUP_SIZE              0x1
#define GC_USB_DOEPINT11_SETUP_DEFAULT           0x0
#define GC_USB_DOEPINT11_SETUP_OFFSET            0xc68
#define GC_USB_DOEPINT11_OUTTKNEPDIS_LSB         0x4
#define GC_USB_DOEPINT11_OUTTKNEPDIS_MASK        0x10
#define GC_USB_DOEPINT11_OUTTKNEPDIS_SIZE        0x1
#define GC_USB_DOEPINT11_OUTTKNEPDIS_DEFAULT     0x0
#define GC_USB_DOEPINT11_OUTTKNEPDIS_OFFSET      0xc68
#define GC_USB_DOEPINT11_STSPHSERCVD_LSB         0x5
#define GC_USB_DOEPINT11_STSPHSERCVD_MASK        0x20
#define GC_USB_DOEPINT11_STSPHSERCVD_SIZE        0x1
#define GC_USB_DOEPINT11_STSPHSERCVD_DEFAULT     0x0
#define GC_USB_DOEPINT11_STSPHSERCVD_OFFSET      0xc68
#define GC_USB_DOEPINT11_BACK2BACKSETUP_LSB      0x6
#define GC_USB_DOEPINT11_BACK2BACKSETUP_MASK     0x40
#define GC_USB_DOEPINT11_BACK2BACKSETUP_SIZE     0x1
#define GC_USB_DOEPINT11_BACK2BACKSETUP_DEFAULT  0x0
#define GC_USB_DOEPINT11_BACK2BACKSETUP_OFFSET   0xc68
#define GC_USB_DOEPINT11_OUTPKTERR_LSB           0x8
#define GC_USB_DOEPINT11_OUTPKTERR_MASK          0x100
#define GC_USB_DOEPINT11_OUTPKTERR_SIZE          0x1
#define GC_USB_DOEPINT11_OUTPKTERR_DEFAULT       0x0
#define GC_USB_DOEPINT11_OUTPKTERR_OFFSET        0xc68
#define GC_USB_DOEPINT11_BNAINTR_LSB             0x9
#define GC_USB_DOEPINT11_BNAINTR_MASK            0x200
#define GC_USB_DOEPINT11_BNAINTR_SIZE            0x1
#define GC_USB_DOEPINT11_BNAINTR_DEFAULT         0x0
#define GC_USB_DOEPINT11_BNAINTR_OFFSET          0xc68
#define GC_USB_DOEPINT11_PKTDRPSTS_LSB           0xb
#define GC_USB_DOEPINT11_PKTDRPSTS_MASK          0x800
#define GC_USB_DOEPINT11_PKTDRPSTS_SIZE          0x1
#define GC_USB_DOEPINT11_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DOEPINT11_PKTDRPSTS_OFFSET        0xc68
#define GC_USB_DOEPINT11_BBLEERR_LSB             0xc
#define GC_USB_DOEPINT11_BBLEERR_MASK            0x1000
#define GC_USB_DOEPINT11_BBLEERR_SIZE            0x1
#define GC_USB_DOEPINT11_BBLEERR_DEFAULT         0x0
#define GC_USB_DOEPINT11_BBLEERR_OFFSET          0xc68
#define GC_USB_DOEPINT11_NAKINTRPT_LSB           0xd
#define GC_USB_DOEPINT11_NAKINTRPT_MASK          0x2000
#define GC_USB_DOEPINT11_NAKINTRPT_SIZE          0x1
#define GC_USB_DOEPINT11_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT11_NAKINTRPT_OFFSET        0xc68
#define GC_USB_DOEPINT11_NYETINTRPT_LSB          0xe
#define GC_USB_DOEPINT11_NYETINTRPT_MASK         0x4000
#define GC_USB_DOEPINT11_NYETINTRPT_SIZE         0x1
#define GC_USB_DOEPINT11_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DOEPINT11_NYETINTRPT_OFFSET       0xc68
#define GC_USB_DOEPINT11_STUPPKTRCVD_LSB         0xf
#define GC_USB_DOEPINT11_STUPPKTRCVD_MASK        0x8000
#define GC_USB_DOEPINT11_STUPPKTRCVD_SIZE        0x1
#define GC_USB_DOEPINT11_STUPPKTRCVD_DEFAULT     0x0
#define GC_USB_DOEPINT11_STUPPKTRCVD_OFFSET      0xc68
#define GC_USB_DOEPTSIZ11_XFERSIZE_LSB           0x0
#define GC_USB_DOEPTSIZ11_XFERSIZE_MASK          0x7ffff
#define GC_USB_DOEPTSIZ11_XFERSIZE_SIZE          0x13
#define GC_USB_DOEPTSIZ11_XFERSIZE_DEFAULT       0x0
#define GC_USB_DOEPTSIZ11_XFERSIZE_OFFSET        0xc70
#define GC_USB_DOEPTSIZ11_PKTCNT_LSB             0x13
#define GC_USB_DOEPTSIZ11_PKTCNT_MASK            0x1ff80000
#define GC_USB_DOEPTSIZ11_PKTCNT_SIZE            0xa
#define GC_USB_DOEPTSIZ11_PKTCNT_DEFAULT         0x0
#define GC_USB_DOEPTSIZ11_PKTCNT_OFFSET          0xc70
#define GC_USB_DOEPTSIZ11_RXDPID_LSB             0x1d
#define GC_USB_DOEPTSIZ11_RXDPID_MASK            0x60000000
#define GC_USB_DOEPTSIZ11_RXDPID_SIZE            0x2
#define GC_USB_DOEPTSIZ11_RXDPID_DEFAULT         0x0
#define GC_USB_DOEPTSIZ11_RXDPID_OFFSET          0xc70
#define GC_USB_DOEPDMA11_DMAADDR_LSB             0x0
#define GC_USB_DOEPDMA11_DMAADDR_MASK            0xffffffff
#define GC_USB_DOEPDMA11_DMAADDR_SIZE            0x20
#define GC_USB_DOEPDMA11_DMAADDR_DEFAULT         0x0
#define GC_USB_DOEPDMA11_DMAADDR_OFFSET          0xc74
#define GC_USB_DOEPDMAB11_DMABUFFERADDR_LSB      0x0
#define GC_USB_DOEPDMAB11_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DOEPDMAB11_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DOEPDMAB11_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DOEPDMAB11_DMABUFFERADDR_OFFSET   0xc7c
#define GC_USB_DOEPCTL12_MPS_LSB                 0x0
#define GC_USB_DOEPCTL12_MPS_MASK                0x7ff
#define GC_USB_DOEPCTL12_MPS_SIZE                0xb
#define GC_USB_DOEPCTL12_MPS_DEFAULT             0x0
#define GC_USB_DOEPCTL12_MPS_OFFSET              0xc80
#define GC_USB_DOEPCTL12_USBACTEP_LSB            0xf
#define GC_USB_DOEPCTL12_USBACTEP_MASK           0x8000
#define GC_USB_DOEPCTL12_USBACTEP_SIZE           0x1
#define GC_USB_DOEPCTL12_USBACTEP_DEFAULT        0x0
#define GC_USB_DOEPCTL12_USBACTEP_OFFSET         0xc80
#define GC_USB_DOEPCTL12_DPID_LSB                0x10
#define GC_USB_DOEPCTL12_DPID_MASK               0x10000
#define GC_USB_DOEPCTL12_DPID_SIZE               0x1
#define GC_USB_DOEPCTL12_DPID_DEFAULT            0x0
#define GC_USB_DOEPCTL12_DPID_OFFSET             0xc80
#define GC_USB_DOEPCTL12_NAKSTS_LSB              0x11
#define GC_USB_DOEPCTL12_NAKSTS_MASK             0x20000
#define GC_USB_DOEPCTL12_NAKSTS_SIZE             0x1
#define GC_USB_DOEPCTL12_NAKSTS_DEFAULT          0x0
#define GC_USB_DOEPCTL12_NAKSTS_OFFSET           0xc80
#define GC_USB_DOEPCTL12_EPTYPE_LSB              0x12
#define GC_USB_DOEPCTL12_EPTYPE_MASK             0xc0000
#define GC_USB_DOEPCTL12_EPTYPE_SIZE             0x2
#define GC_USB_DOEPCTL12_EPTYPE_DEFAULT          0x0
#define GC_USB_DOEPCTL12_EPTYPE_OFFSET           0xc80
#define GC_USB_DOEPCTL12_SNP_LSB                 0x14
#define GC_USB_DOEPCTL12_SNP_MASK                0x100000
#define GC_USB_DOEPCTL12_SNP_SIZE                0x1
#define GC_USB_DOEPCTL12_SNP_DEFAULT             0x0
#define GC_USB_DOEPCTL12_SNP_OFFSET              0xc80
#define GC_USB_DOEPCTL12_STALL_LSB               0x15
#define GC_USB_DOEPCTL12_STALL_MASK              0x200000
#define GC_USB_DOEPCTL12_STALL_SIZE              0x1
#define GC_USB_DOEPCTL12_STALL_DEFAULT           0x0
#define GC_USB_DOEPCTL12_STALL_OFFSET            0xc80
#define GC_USB_DOEPCTL12_CNAK_LSB                0x1a
#define GC_USB_DOEPCTL12_CNAK_MASK               0x4000000
#define GC_USB_DOEPCTL12_CNAK_SIZE               0x1
#define GC_USB_DOEPCTL12_CNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL12_CNAK_OFFSET             0xc80
#define GC_USB_DOEPCTL12_SNAK_LSB                0x1b
#define GC_USB_DOEPCTL12_SNAK_MASK               0x8000000
#define GC_USB_DOEPCTL12_SNAK_SIZE               0x1
#define GC_USB_DOEPCTL12_SNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL12_SNAK_OFFSET             0xc80
#define GC_USB_DOEPCTL12_SETD0PID_LSB            0x1c
#define GC_USB_DOEPCTL12_SETD0PID_MASK           0x10000000
#define GC_USB_DOEPCTL12_SETD0PID_SIZE           0x1
#define GC_USB_DOEPCTL12_SETD0PID_DEFAULT        0x0
#define GC_USB_DOEPCTL12_SETD0PID_OFFSET         0xc80
#define GC_USB_DOEPCTL12_SETD1PID_LSB            0x1d
#define GC_USB_DOEPCTL12_SETD1PID_MASK           0x20000000
#define GC_USB_DOEPCTL12_SETD1PID_SIZE           0x1
#define GC_USB_DOEPCTL12_SETD1PID_DEFAULT        0x0
#define GC_USB_DOEPCTL12_SETD1PID_OFFSET         0xc80
#define GC_USB_DOEPCTL12_EPDIS_LSB               0x1e
#define GC_USB_DOEPCTL12_EPDIS_MASK              0x40000000
#define GC_USB_DOEPCTL12_EPDIS_SIZE              0x1
#define GC_USB_DOEPCTL12_EPDIS_DEFAULT           0x0
#define GC_USB_DOEPCTL12_EPDIS_OFFSET            0xc80
#define GC_USB_DOEPCTL12_EPENA_LSB               0x1f
#define GC_USB_DOEPCTL12_EPENA_MASK              0x80000000
#define GC_USB_DOEPCTL12_EPENA_SIZE              0x1
#define GC_USB_DOEPCTL12_EPENA_DEFAULT           0x0
#define GC_USB_DOEPCTL12_EPENA_OFFSET            0xc80
#define GC_USB_DOEPINT12_XFERCOMPL_LSB           0x0
#define GC_USB_DOEPINT12_XFERCOMPL_MASK          0x1
#define GC_USB_DOEPINT12_XFERCOMPL_SIZE          0x1
#define GC_USB_DOEPINT12_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DOEPINT12_XFERCOMPL_OFFSET        0xc88
#define GC_USB_DOEPINT12_EPDISBLD_LSB            0x1
#define GC_USB_DOEPINT12_EPDISBLD_MASK           0x2
#define GC_USB_DOEPINT12_EPDISBLD_SIZE           0x1
#define GC_USB_DOEPINT12_EPDISBLD_DEFAULT        0x0
#define GC_USB_DOEPINT12_EPDISBLD_OFFSET         0xc88
#define GC_USB_DOEPINT12_AHBERR_LSB              0x2
#define GC_USB_DOEPINT12_AHBERR_MASK             0x4
#define GC_USB_DOEPINT12_AHBERR_SIZE             0x1
#define GC_USB_DOEPINT12_AHBERR_DEFAULT          0x0
#define GC_USB_DOEPINT12_AHBERR_OFFSET           0xc88
#define GC_USB_DOEPINT12_SETUP_LSB               0x3
#define GC_USB_DOEPINT12_SETUP_MASK              0x8
#define GC_USB_DOEPINT12_SETUP_SIZE              0x1
#define GC_USB_DOEPINT12_SETUP_DEFAULT           0x0
#define GC_USB_DOEPINT12_SETUP_OFFSET            0xc88
#define GC_USB_DOEPINT12_OUTTKNEPDIS_LSB         0x4
#define GC_USB_DOEPINT12_OUTTKNEPDIS_MASK        0x10
#define GC_USB_DOEPINT12_OUTTKNEPDIS_SIZE        0x1
#define GC_USB_DOEPINT12_OUTTKNEPDIS_DEFAULT     0x0
#define GC_USB_DOEPINT12_OUTTKNEPDIS_OFFSET      0xc88
#define GC_USB_DOEPINT12_STSPHSERCVD_LSB         0x5
#define GC_USB_DOEPINT12_STSPHSERCVD_MASK        0x20
#define GC_USB_DOEPINT12_STSPHSERCVD_SIZE        0x1
#define GC_USB_DOEPINT12_STSPHSERCVD_DEFAULT     0x0
#define GC_USB_DOEPINT12_STSPHSERCVD_OFFSET      0xc88
#define GC_USB_DOEPINT12_BACK2BACKSETUP_LSB      0x6
#define GC_USB_DOEPINT12_BACK2BACKSETUP_MASK     0x40
#define GC_USB_DOEPINT12_BACK2BACKSETUP_SIZE     0x1
#define GC_USB_DOEPINT12_BACK2BACKSETUP_DEFAULT  0x0
#define GC_USB_DOEPINT12_BACK2BACKSETUP_OFFSET   0xc88
#define GC_USB_DOEPINT12_OUTPKTERR_LSB           0x8
#define GC_USB_DOEPINT12_OUTPKTERR_MASK          0x100
#define GC_USB_DOEPINT12_OUTPKTERR_SIZE          0x1
#define GC_USB_DOEPINT12_OUTPKTERR_DEFAULT       0x0
#define GC_USB_DOEPINT12_OUTPKTERR_OFFSET        0xc88
#define GC_USB_DOEPINT12_BNAINTR_LSB             0x9
#define GC_USB_DOEPINT12_BNAINTR_MASK            0x200
#define GC_USB_DOEPINT12_BNAINTR_SIZE            0x1
#define GC_USB_DOEPINT12_BNAINTR_DEFAULT         0x0
#define GC_USB_DOEPINT12_BNAINTR_OFFSET          0xc88
#define GC_USB_DOEPINT12_PKTDRPSTS_LSB           0xb
#define GC_USB_DOEPINT12_PKTDRPSTS_MASK          0x800
#define GC_USB_DOEPINT12_PKTDRPSTS_SIZE          0x1
#define GC_USB_DOEPINT12_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DOEPINT12_PKTDRPSTS_OFFSET        0xc88
#define GC_USB_DOEPINT12_BBLEERR_LSB             0xc
#define GC_USB_DOEPINT12_BBLEERR_MASK            0x1000
#define GC_USB_DOEPINT12_BBLEERR_SIZE            0x1
#define GC_USB_DOEPINT12_BBLEERR_DEFAULT         0x0
#define GC_USB_DOEPINT12_BBLEERR_OFFSET          0xc88
#define GC_USB_DOEPINT12_NAKINTRPT_LSB           0xd
#define GC_USB_DOEPINT12_NAKINTRPT_MASK          0x2000
#define GC_USB_DOEPINT12_NAKINTRPT_SIZE          0x1
#define GC_USB_DOEPINT12_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT12_NAKINTRPT_OFFSET        0xc88
#define GC_USB_DOEPINT12_NYETINTRPT_LSB          0xe
#define GC_USB_DOEPINT12_NYETINTRPT_MASK         0x4000
#define GC_USB_DOEPINT12_NYETINTRPT_SIZE         0x1
#define GC_USB_DOEPINT12_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DOEPINT12_NYETINTRPT_OFFSET       0xc88
#define GC_USB_DOEPINT12_STUPPKTRCVD_LSB         0xf
#define GC_USB_DOEPINT12_STUPPKTRCVD_MASK        0x8000
#define GC_USB_DOEPINT12_STUPPKTRCVD_SIZE        0x1
#define GC_USB_DOEPINT12_STUPPKTRCVD_DEFAULT     0x0
#define GC_USB_DOEPINT12_STUPPKTRCVD_OFFSET      0xc88
#define GC_USB_DOEPTSIZ12_XFERSIZE_LSB           0x0
#define GC_USB_DOEPTSIZ12_XFERSIZE_MASK          0x7ffff
#define GC_USB_DOEPTSIZ12_XFERSIZE_SIZE          0x13
#define GC_USB_DOEPTSIZ12_XFERSIZE_DEFAULT       0x0
#define GC_USB_DOEPTSIZ12_XFERSIZE_OFFSET        0xc90
#define GC_USB_DOEPTSIZ12_PKTCNT_LSB             0x13
#define GC_USB_DOEPTSIZ12_PKTCNT_MASK            0x1ff80000
#define GC_USB_DOEPTSIZ12_PKTCNT_SIZE            0xa
#define GC_USB_DOEPTSIZ12_PKTCNT_DEFAULT         0x0
#define GC_USB_DOEPTSIZ12_PKTCNT_OFFSET          0xc90
#define GC_USB_DOEPTSIZ12_RXDPID_LSB             0x1d
#define GC_USB_DOEPTSIZ12_RXDPID_MASK            0x60000000
#define GC_USB_DOEPTSIZ12_RXDPID_SIZE            0x2
#define GC_USB_DOEPTSIZ12_RXDPID_DEFAULT         0x0
#define GC_USB_DOEPTSIZ12_RXDPID_OFFSET          0xc90
#define GC_USB_DOEPDMA12_DMAADDR_LSB             0x0
#define GC_USB_DOEPDMA12_DMAADDR_MASK            0xffffffff
#define GC_USB_DOEPDMA12_DMAADDR_SIZE            0x20
#define GC_USB_DOEPDMA12_DMAADDR_DEFAULT         0x0
#define GC_USB_DOEPDMA12_DMAADDR_OFFSET          0xc94
#define GC_USB_DOEPDMAB12_DMABUFFERADDR_LSB      0x0
#define GC_USB_DOEPDMAB12_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DOEPDMAB12_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DOEPDMAB12_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DOEPDMAB12_DMABUFFERADDR_OFFSET   0xc9c
#define GC_USB_DOEPCTL13_MPS_LSB                 0x0
#define GC_USB_DOEPCTL13_MPS_MASK                0x7ff
#define GC_USB_DOEPCTL13_MPS_SIZE                0xb
#define GC_USB_DOEPCTL13_MPS_DEFAULT             0x0
#define GC_USB_DOEPCTL13_MPS_OFFSET              0xca0
#define GC_USB_DOEPCTL13_USBACTEP_LSB            0xf
#define GC_USB_DOEPCTL13_USBACTEP_MASK           0x8000
#define GC_USB_DOEPCTL13_USBACTEP_SIZE           0x1
#define GC_USB_DOEPCTL13_USBACTEP_DEFAULT        0x0
#define GC_USB_DOEPCTL13_USBACTEP_OFFSET         0xca0
#define GC_USB_DOEPCTL13_DPID_LSB                0x10
#define GC_USB_DOEPCTL13_DPID_MASK               0x10000
#define GC_USB_DOEPCTL13_DPID_SIZE               0x1
#define GC_USB_DOEPCTL13_DPID_DEFAULT            0x0
#define GC_USB_DOEPCTL13_DPID_OFFSET             0xca0
#define GC_USB_DOEPCTL13_NAKSTS_LSB              0x11
#define GC_USB_DOEPCTL13_NAKSTS_MASK             0x20000
#define GC_USB_DOEPCTL13_NAKSTS_SIZE             0x1
#define GC_USB_DOEPCTL13_NAKSTS_DEFAULT          0x0
#define GC_USB_DOEPCTL13_NAKSTS_OFFSET           0xca0
#define GC_USB_DOEPCTL13_EPTYPE_LSB              0x12
#define GC_USB_DOEPCTL13_EPTYPE_MASK             0xc0000
#define GC_USB_DOEPCTL13_EPTYPE_SIZE             0x2
#define GC_USB_DOEPCTL13_EPTYPE_DEFAULT          0x0
#define GC_USB_DOEPCTL13_EPTYPE_OFFSET           0xca0
#define GC_USB_DOEPCTL13_SNP_LSB                 0x14
#define GC_USB_DOEPCTL13_SNP_MASK                0x100000
#define GC_USB_DOEPCTL13_SNP_SIZE                0x1
#define GC_USB_DOEPCTL13_SNP_DEFAULT             0x0
#define GC_USB_DOEPCTL13_SNP_OFFSET              0xca0
#define GC_USB_DOEPCTL13_STALL_LSB               0x15
#define GC_USB_DOEPCTL13_STALL_MASK              0x200000
#define GC_USB_DOEPCTL13_STALL_SIZE              0x1
#define GC_USB_DOEPCTL13_STALL_DEFAULT           0x0
#define GC_USB_DOEPCTL13_STALL_OFFSET            0xca0
#define GC_USB_DOEPCTL13_CNAK_LSB                0x1a
#define GC_USB_DOEPCTL13_CNAK_MASK               0x4000000
#define GC_USB_DOEPCTL13_CNAK_SIZE               0x1
#define GC_USB_DOEPCTL13_CNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL13_CNAK_OFFSET             0xca0
#define GC_USB_DOEPCTL13_SNAK_LSB                0x1b
#define GC_USB_DOEPCTL13_SNAK_MASK               0x8000000
#define GC_USB_DOEPCTL13_SNAK_SIZE               0x1
#define GC_USB_DOEPCTL13_SNAK_DEFAULT            0x0
