FrameworkComputer/EmbeddedController/chip/stm32/usb_dwc_registers.h
#define GC_USB_DOEPCTL13_SNAK_OFFSET             0xca0
#define GC_USB_DOEPCTL13_SETD0PID_LSB            0x1c
#define GC_USB_DOEPCTL13_SETD0PID_MASK           0x10000000
#define GC_USB_DOEPCTL13_SETD0PID_SIZE           0x1
#define GC_USB_DOEPCTL13_SETD0PID_DEFAULT        0x0
#define GC_USB_DOEPCTL13_SETD0PID_OFFSET         0xca0
#define GC_USB_DOEPCTL13_SETD1PID_LSB            0x1d
#define GC_USB_DOEPCTL13_SETD1PID_MASK           0x20000000
#define GC_USB_DOEPCTL13_SETD1PID_SIZE           0x1
#define GC_USB_DOEPCTL13_SETD1PID_DEFAULT        0x0
#define GC_USB_DOEPCTL13_SETD1PID_OFFSET         0xca0
#define GC_USB_DOEPCTL13_EPDIS_LSB               0x1e
#define GC_USB_DOEPCTL13_EPDIS_MASK              0x40000000
#define GC_USB_DOEPCTL13_EPDIS_SIZE              0x1
#define GC_USB_DOEPCTL13_EPDIS_DEFAULT           0x0
#define GC_USB_DOEPCTL13_EPDIS_OFFSET            0xca0
#define GC_USB_DOEPCTL13_EPENA_LSB               0x1f
#define GC_USB_DOEPCTL13_EPENA_MASK              0x80000000
#define GC_USB_DOEPCTL13_EPENA_SIZE              0x1
#define GC_USB_DOEPCTL13_EPENA_DEFAULT           0x0
#define GC_USB_DOEPCTL13_EPENA_OFFSET            0xca0
#define GC_USB_DOEPINT13_XFERCOMPL_LSB           0x0
#define GC_USB_DOEPINT13_XFERCOMPL_MASK          0x1
#define GC_USB_DOEPINT13_XFERCOMPL_SIZE          0x1
#define GC_USB_DOEPINT13_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DOEPINT13_XFERCOMPL_OFFSET        0xca8
#define GC_USB_DOEPINT13_EPDISBLD_LSB            0x1
#define GC_USB_DOEPINT13_EPDISBLD_MASK           0x2
#define GC_USB_DOEPINT13_EPDISBLD_SIZE           0x1
#define GC_USB_DOEPINT13_EPDISBLD_DEFAULT        0x0
#define GC_USB_DOEPINT13_EPDISBLD_OFFSET         0xca8
#define GC_USB_DOEPINT13_AHBERR_LSB              0x2
#define GC_USB_DOEPINT13_AHBERR_MASK             0x4
#define GC_USB_DOEPINT13_AHBERR_SIZE             0x1
#define GC_USB_DOEPINT13_AHBERR_DEFAULT          0x0
#define GC_USB_DOEPINT13_AHBERR_OFFSET           0xca8
#define GC_USB_DOEPINT13_SETUP_LSB               0x3
#define GC_USB_DOEPINT13_SETUP_MASK              0x8
#define GC_USB_DOEPINT13_SETUP_SIZE              0x1
#define GC_USB_DOEPINT13_SETUP_DEFAULT           0x0
#define GC_USB_DOEPINT13_SETUP_OFFSET            0xca8
#define GC_USB_DOEPINT13_OUTTKNEPDIS_LSB         0x4
#define GC_USB_DOEPINT13_OUTTKNEPDIS_MASK        0x10
#define GC_USB_DOEPINT13_OUTTKNEPDIS_SIZE        0x1
#define GC_USB_DOEPINT13_OUTTKNEPDIS_DEFAULT     0x0
#define GC_USB_DOEPINT13_OUTTKNEPDIS_OFFSET      0xca8
#define GC_USB_DOEPINT13_STSPHSERCVD_LSB         0x5
#define GC_USB_DOEPINT13_STSPHSERCVD_MASK        0x20
#define GC_USB_DOEPINT13_STSPHSERCVD_SIZE        0x1
#define GC_USB_DOEPINT13_STSPHSERCVD_DEFAULT     0x0
#define GC_USB_DOEPINT13_STSPHSERCVD_OFFSET      0xca8
#define GC_USB_DOEPINT13_BACK2BACKSETUP_LSB      0x6
#define GC_USB_DOEPINT13_BACK2BACKSETUP_MASK     0x40
#define GC_USB_DOEPINT13_BACK2BACKSETUP_SIZE     0x1
#define GC_USB_DOEPINT13_BACK2BACKSETUP_DEFAULT  0x0
#define GC_USB_DOEPINT13_BACK2BACKSETUP_OFFSET   0xca8
#define GC_USB_DOEPINT13_OUTPKTERR_LSB           0x8
#define GC_USB_DOEPINT13_OUTPKTERR_MASK          0x100
#define GC_USB_DOEPINT13_OUTPKTERR_SIZE          0x1
#define GC_USB_DOEPINT13_OUTPKTERR_DEFAULT       0x0
#define GC_USB_DOEPINT13_OUTPKTERR_OFFSET        0xca8
#define GC_USB_DOEPINT13_BNAINTR_LSB             0x9
#define GC_USB_DOEPINT13_BNAINTR_MASK            0x200
#define GC_USB_DOEPINT13_BNAINTR_SIZE            0x1
#define GC_USB_DOEPINT13_BNAINTR_DEFAULT         0x0
#define GC_USB_DOEPINT13_BNAINTR_OFFSET          0xca8
#define GC_USB_DOEPINT13_PKTDRPSTS_LSB           0xb
#define GC_USB_DOEPINT13_PKTDRPSTS_MASK          0x800
#define GC_USB_DOEPINT13_PKTDRPSTS_SIZE          0x1
#define GC_USB_DOEPINT13_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DOEPINT13_PKTDRPSTS_OFFSET        0xca8
#define GC_USB_DOEPINT13_BBLEERR_LSB             0xc
#define GC_USB_DOEPINT13_BBLEERR_MASK            0x1000
#define GC_USB_DOEPINT13_BBLEERR_SIZE            0x1
#define GC_USB_DOEPINT13_BBLEERR_DEFAULT         0x0
#define GC_USB_DOEPINT13_BBLEERR_OFFSET          0xca8
#define GC_USB_DOEPINT13_NAKINTRPT_LSB           0xd
#define GC_USB_DOEPINT13_NAKINTRPT_MASK          0x2000
#define GC_USB_DOEPINT13_NAKINTRPT_SIZE          0x1
#define GC_USB_DOEPINT13_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT13_NAKINTRPT_OFFSET        0xca8
#define GC_USB_DOEPINT13_NYETINTRPT_LSB          0xe
#define GC_USB_DOEPINT13_NYETINTRPT_MASK         0x4000
#define GC_USB_DOEPINT13_NYETINTRPT_SIZE         0x1
#define GC_USB_DOEPINT13_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DOEPINT13_NYETINTRPT_OFFSET       0xca8
#define GC_USB_DOEPINT13_STUPPKTRCVD_LSB         0xf
#define GC_USB_DOEPINT13_STUPPKTRCVD_MASK        0x8000
#define GC_USB_DOEPINT13_STUPPKTRCVD_SIZE        0x1
#define GC_USB_DOEPINT13_STUPPKTRCVD_DEFAULT     0x0
#define GC_USB_DOEPINT13_STUPPKTRCVD_OFFSET      0xca8
#define GC_USB_DOEPTSIZ13_XFERSIZE_LSB           0x0
#define GC_USB_DOEPTSIZ13_XFERSIZE_MASK          0x7ffff
#define GC_USB_DOEPTSIZ13_XFERSIZE_SIZE          0x13
#define GC_USB_DOEPTSIZ13_XFERSIZE_DEFAULT       0x0
#define GC_USB_DOEPTSIZ13_XFERSIZE_OFFSET        0xcb0
#define GC_USB_DOEPTSIZ13_PKTCNT_LSB             0x13
#define GC_USB_DOEPTSIZ13_PKTCNT_MASK            0x1ff80000
#define GC_USB_DOEPTSIZ13_PKTCNT_SIZE            0xa
#define GC_USB_DOEPTSIZ13_PKTCNT_DEFAULT         0x0
#define GC_USB_DOEPTSIZ13_PKTCNT_OFFSET          0xcb0
#define GC_USB_DOEPTSIZ13_RXDPID_LSB             0x1d
#define GC_USB_DOEPTSIZ13_RXDPID_MASK            0x60000000
#define GC_USB_DOEPTSIZ13_RXDPID_SIZE            0x2
#define GC_USB_DOEPTSIZ13_RXDPID_DEFAULT         0x0
#define GC_USB_DOEPTSIZ13_RXDPID_OFFSET          0xcb0
#define GC_USB_DOEPDMA13_DMAADDR_LSB             0x0
#define GC_USB_DOEPDMA13_DMAADDR_MASK            0xffffffff
#define GC_USB_DOEPDMA13_DMAADDR_SIZE            0x20
#define GC_USB_DOEPDMA13_DMAADDR_DEFAULT         0x0
#define GC_USB_DOEPDMA13_DMAADDR_OFFSET          0xcb4
#define GC_USB_DOEPDMAB13_DMABUFFERADDR_LSB      0x0
#define GC_USB_DOEPDMAB13_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DOEPDMAB13_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DOEPDMAB13_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DOEPDMAB13_DMABUFFERADDR_OFFSET   0xcbc
#define GC_USB_DOEPCTL14_MPS_LSB                 0x0
#define GC_USB_DOEPCTL14_MPS_MASK                0x7ff
#define GC_USB_DOEPCTL14_MPS_SIZE                0xb
#define GC_USB_DOEPCTL14_MPS_DEFAULT             0x0
#define GC_USB_DOEPCTL14_MPS_OFFSET              0xcc0
#define GC_USB_DOEPCTL14_USBACTEP_LSB            0xf
#define GC_USB_DOEPCTL14_USBACTEP_MASK           0x8000
#define GC_USB_DOEPCTL14_USBACTEP_SIZE           0x1
#define GC_USB_DOEPCTL14_USBACTEP_DEFAULT        0x0
#define GC_USB_DOEPCTL14_USBACTEP_OFFSET         0xcc0
#define GC_USB_DOEPCTL14_DPID_LSB                0x10
#define GC_USB_DOEPCTL14_DPID_MASK               0x10000
#define GC_USB_DOEPCTL14_DPID_SIZE               0x1
#define GC_USB_DOEPCTL14_DPID_DEFAULT            0x0
#define GC_USB_DOEPCTL14_DPID_OFFSET             0xcc0
#define GC_USB_DOEPCTL14_NAKSTS_LSB              0x11
#define GC_USB_DOEPCTL14_NAKSTS_MASK             0x20000
#define GC_USB_DOEPCTL14_NAKSTS_SIZE             0x1
#define GC_USB_DOEPCTL14_NAKSTS_DEFAULT          0x0
#define GC_USB_DOEPCTL14_NAKSTS_OFFSET           0xcc0
#define GC_USB_DOEPCTL14_EPTYPE_LSB              0x12
#define GC_USB_DOEPCTL14_EPTYPE_MASK             0xc0000
#define GC_USB_DOEPCTL14_EPTYPE_SIZE             0x2
#define GC_USB_DOEPCTL14_EPTYPE_DEFAULT          0x0
#define GC_USB_DOEPCTL14_EPTYPE_OFFSET           0xcc0
#define GC_USB_DOEPCTL14_SNP_LSB                 0x14
#define GC_USB_DOEPCTL14_SNP_MASK                0x100000
#define GC_USB_DOEPCTL14_SNP_SIZE                0x1
#define GC_USB_DOEPCTL14_SNP_DEFAULT             0x0
#define GC_USB_DOEPCTL14_SNP_OFFSET              0xcc0
#define GC_USB_DOEPCTL14_STALL_LSB               0x15
#define GC_USB_DOEPCTL14_STALL_MASK              0x200000
#define GC_USB_DOEPCTL14_STALL_SIZE              0x1
#define GC_USB_DOEPCTL14_STALL_DEFAULT           0x0
#define GC_USB_DOEPCTL14_STALL_OFFSET            0xcc0
#define GC_USB_DOEPCTL14_CNAK_LSB                0x1a
#define GC_USB_DOEPCTL14_CNAK_MASK               0x4000000
#define GC_USB_DOEPCTL14_CNAK_SIZE               0x1
#define GC_USB_DOEPCTL14_CNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL14_CNAK_OFFSET             0xcc0
#define GC_USB_DOEPCTL14_SNAK_LSB                0x1b
#define GC_USB_DOEPCTL14_SNAK_MASK               0x8000000
#define GC_USB_DOEPCTL14_SNAK_SIZE               0x1
#define GC_USB_DOEPCTL14_SNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL14_SNAK_OFFSET             0xcc0
#define GC_USB_DOEPCTL14_SETD0PID_LSB            0x1c
#define GC_USB_DOEPCTL14_SETD0PID_MASK           0x10000000
#define GC_USB_DOEPCTL14_SETD0PID_SIZE           0x1
#define GC_USB_DOEPCTL14_SETD0PID_DEFAULT        0x0
#define GC_USB_DOEPCTL14_SETD0PID_OFFSET         0xcc0
#define GC_USB_DOEPCTL14_SETD1PID_LSB            0x1d
#define GC_USB_DOEPCTL14_SETD1PID_MASK           0x20000000
#define GC_USB_DOEPCTL14_SETD1PID_SIZE           0x1
#define GC_USB_DOEPCTL14_SETD1PID_DEFAULT        0x0
#define GC_USB_DOEPCTL14_SETD1PID_OFFSET         0xcc0
#define GC_USB_DOEPCTL14_EPDIS_LSB               0x1e
#define GC_USB_DOEPCTL14_EPDIS_MASK              0x40000000
#define GC_USB_DOEPCTL14_EPDIS_SIZE              0x1
#define GC_USB_DOEPCTL14_EPDIS_DEFAULT           0x0
#define GC_USB_DOEPCTL14_EPDIS_OFFSET            0xcc0
#define GC_USB_DOEPCTL14_EPENA_LSB               0x1f
#define GC_USB_DOEPCTL14_EPENA_MASK              0x80000000
#define GC_USB_DOEPCTL14_EPENA_SIZE              0x1
#define GC_USB_DOEPCTL14_EPENA_DEFAULT           0x0
#define GC_USB_DOEPCTL14_EPENA_OFFSET            0xcc0
#define GC_USB_DOEPINT14_XFERCOMPL_LSB           0x0
#define GC_USB_DOEPINT14_XFERCOMPL_MASK          0x1
#define GC_USB_DOEPINT14_XFERCOMPL_SIZE          0x1
#define GC_USB_DOEPINT14_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DOEPINT14_XFERCOMPL_OFFSET        0xcc8
#define GC_USB_DOEPINT14_EPDISBLD_LSB            0x1
#define GC_USB_DOEPINT14_EPDISBLD_MASK           0x2
#define GC_USB_DOEPINT14_EPDISBLD_SIZE           0x1
#define GC_USB_DOEPINT14_EPDISBLD_DEFAULT        0x0
#define GC_USB_DOEPINT14_EPDISBLD_OFFSET         0xcc8
#define GC_USB_DOEPINT14_AHBERR_LSB              0x2
#define GC_USB_DOEPINT14_AHBERR_MASK             0x4
#define GC_USB_DOEPINT14_AHBERR_SIZE             0x1
#define GC_USB_DOEPINT14_AHBERR_DEFAULT          0x0
#define GC_USB_DOEPINT14_AHBERR_OFFSET           0xcc8
#define GC_USB_DOEPINT14_SETUP_LSB               0x3
#define GC_USB_DOEPINT14_SETUP_MASK              0x8
#define GC_USB_DOEPINT14_SETUP_SIZE              0x1
#define GC_USB_DOEPINT14_SETUP_DEFAULT           0x0
#define GC_USB_DOEPINT14_SETUP_OFFSET            0xcc8
#define GC_USB_DOEPINT14_OUTTKNEPDIS_LSB         0x4
#define GC_USB_DOEPINT14_OUTTKNEPDIS_MASK        0x10
#define GC_USB_DOEPINT14_OUTTKNEPDIS_SIZE        0x1
#define GC_USB_DOEPINT14_OUTTKNEPDIS_DEFAULT     0x0
#define GC_USB_DOEPINT14_OUTTKNEPDIS_OFFSET      0xcc8
#define GC_USB_DOEPINT14_STSPHSERCVD_LSB         0x5
#define GC_USB_DOEPINT14_STSPHSERCVD_MASK        0x20
#define GC_USB_DOEPINT14_STSPHSERCVD_SIZE        0x1
#define GC_USB_DOEPINT14_STSPHSERCVD_DEFAULT     0x0
#define GC_USB_DOEPINT14_STSPHSERCVD_OFFSET      0xcc8
#define GC_USB_DOEPINT14_BACK2BACKSETUP_LSB      0x6
#define GC_USB_DOEPINT14_BACK2BACKSETUP_MASK     0x40
#define GC_USB_DOEPINT14_BACK2BACKSETUP_SIZE     0x1
#define GC_USB_DOEPINT14_BACK2BACKSETUP_DEFAULT  0x0
#define GC_USB_DOEPINT14_BACK2BACKSETUP_OFFSET   0xcc8
#define GC_USB_DOEPINT14_OUTPKTERR_LSB           0x8
#define GC_USB_DOEPINT14_OUTPKTERR_MASK          0x100
#define GC_USB_DOEPINT14_OUTPKTERR_SIZE          0x1
#define GC_USB_DOEPINT14_OUTPKTERR_DEFAULT       0x0
#define GC_USB_DOEPINT14_OUTPKTERR_OFFSET        0xcc8
#define GC_USB_DOEPINT14_BNAINTR_LSB             0x9
#define GC_USB_DOEPINT14_BNAINTR_MASK            0x200
#define GC_USB_DOEPINT14_BNAINTR_SIZE            0x1
#define GC_USB_DOEPINT14_BNAINTR_DEFAULT         0x0
#define GC_USB_DOEPINT14_BNAINTR_OFFSET          0xcc8
#define GC_USB_DOEPINT14_PKTDRPSTS_LSB           0xb
#define GC_USB_DOEPINT14_PKTDRPSTS_MASK          0x800
#define GC_USB_DOEPINT14_PKTDRPSTS_SIZE          0x1
#define GC_USB_DOEPINT14_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DOEPINT14_PKTDRPSTS_OFFSET        0xcc8
#define GC_USB_DOEPINT14_BBLEERR_LSB             0xc
#define GC_USB_DOEPINT14_BBLEERR_MASK            0x1000
#define GC_USB_DOEPINT14_BBLEERR_SIZE            0x1
#define GC_USB_DOEPINT14_BBLEERR_DEFAULT         0x0
#define GC_USB_DOEPINT14_BBLEERR_OFFSET          0xcc8
#define GC_USB_DOEPINT14_NAKINTRPT_LSB           0xd
#define GC_USB_DOEPINT14_NAKINTRPT_MASK          0x2000
#define GC_USB_DOEPINT14_NAKINTRPT_SIZE          0x1
#define GC_USB_DOEPINT14_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT14_NAKINTRPT_OFFSET        0xcc8
#define GC_USB_DOEPINT14_NYETINTRPT_LSB          0xe
#define GC_USB_DOEPINT14_NYETINTRPT_MASK         0x4000
#define GC_USB_DOEPINT14_NYETINTRPT_SIZE         0x1
#define GC_USB_DOEPINT14_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DOEPINT14_NYETINTRPT_OFFSET       0xcc8
#define GC_USB_DOEPINT14_STUPPKTRCVD_LSB         0xf
#define GC_USB_DOEPINT14_STUPPKTRCVD_MASK        0x8000
#define GC_USB_DOEPINT14_STUPPKTRCVD_SIZE        0x1
#define GC_USB_DOEPINT14_STUPPKTRCVD_DEFAULT     0x0
#define GC_USB_DOEPINT14_STUPPKTRCVD_OFFSET      0xcc8
#define GC_USB_DOEPTSIZ14_XFERSIZE_LSB           0x0
#define GC_USB_DOEPTSIZ14_XFERSIZE_MASK          0x7ffff
#define GC_USB_DOEPTSIZ14_XFERSIZE_SIZE          0x13
#define GC_USB_DOEPTSIZ14_XFERSIZE_DEFAULT       0x0
#define GC_USB_DOEPTSIZ14_XFERSIZE_OFFSET        0xcd0
#define GC_USB_DOEPTSIZ14_PKTCNT_LSB             0x13
#define GC_USB_DOEPTSIZ14_PKTCNT_MASK            0x1ff80000
#define GC_USB_DOEPTSIZ14_PKTCNT_SIZE            0xa
#define GC_USB_DOEPTSIZ14_PKTCNT_DEFAULT         0x0
#define GC_USB_DOEPTSIZ14_PKTCNT_OFFSET          0xcd0
#define GC_USB_DOEPTSIZ14_RXDPID_LSB             0x1d
#define GC_USB_DOEPTSIZ14_RXDPID_MASK            0x60000000
#define GC_USB_DOEPTSIZ14_RXDPID_SIZE            0x2
#define GC_USB_DOEPTSIZ14_RXDPID_DEFAULT         0x0
#define GC_USB_DOEPTSIZ14_RXDPID_OFFSET          0xcd0
#define GC_USB_DOEPDMA14_DMAADDR_LSB             0x0
#define GC_USB_DOEPDMA14_DMAADDR_MASK            0xffffffff
#define GC_USB_DOEPDMA14_DMAADDR_SIZE            0x20
#define GC_USB_DOEPDMA14_DMAADDR_DEFAULT         0x0
#define GC_USB_DOEPDMA14_DMAADDR_OFFSET          0xcd4
#define GC_USB_DOEPDMAB14_DMABUFFERADDR_LSB      0x0
#define GC_USB_DOEPDMAB14_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DOEPDMAB14_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DOEPDMAB14_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DOEPDMAB14_DMABUFFERADDR_OFFSET   0xcdc
#define GC_USB_DOEPCTL15_MPS_LSB                 0x0
#define GC_USB_DOEPCTL15_MPS_MASK                0x7ff
#define GC_USB_DOEPCTL15_MPS_SIZE                0xb
#define GC_USB_DOEPCTL15_MPS_DEFAULT             0x0
#define GC_USB_DOEPCTL15_MPS_OFFSET              0xce0
#define GC_USB_DOEPCTL15_USBACTEP_LSB            0xf
#define GC_USB_DOEPCTL15_USBACTEP_MASK           0x8000
#define GC_USB_DOEPCTL15_USBACTEP_SIZE           0x1
#define GC_USB_DOEPCTL15_USBACTEP_DEFAULT        0x0
#define GC_USB_DOEPCTL15_USBACTEP_OFFSET         0xce0
#define GC_USB_DOEPCTL15_DPID_LSB                0x10
#define GC_USB_DOEPCTL15_DPID_MASK               0x10000
#define GC_USB_DOEPCTL15_DPID_SIZE               0x1
#define GC_USB_DOEPCTL15_DPID_DEFAULT            0x0
#define GC_USB_DOEPCTL15_DPID_OFFSET             0xce0
#define GC_USB_DOEPCTL15_NAKSTS_LSB              0x11
#define GC_USB_DOEPCTL15_NAKSTS_MASK             0x20000
#define GC_USB_DOEPCTL15_NAKSTS_SIZE             0x1
#define GC_USB_DOEPCTL15_NAKSTS_DEFAULT          0x0
#define GC_USB_DOEPCTL15_NAKSTS_OFFSET           0xce0
#define GC_USB_DOEPCTL15_EPTYPE_LSB              0x12
#define GC_USB_DOEPCTL15_EPTYPE_MASK             0xc0000
#define GC_USB_DOEPCTL15_EPTYPE_SIZE             0x2
#define GC_USB_DOEPCTL15_EPTYPE_DEFAULT          0x0
#define GC_USB_DOEPCTL15_EPTYPE_OFFSET           0xce0
#define GC_USB_DOEPCTL15_SNP_LSB                 0x14
#define GC_USB_DOEPCTL15_SNP_MASK                0x100000
#define GC_USB_DOEPCTL15_SNP_SIZE                0x1
#define GC_USB_DOEPCTL15_SNP_DEFAULT             0x0
#define GC_USB_DOEPCTL15_SNP_OFFSET              0xce0
#define GC_USB_DOEPCTL15_STALL_LSB               0x15
#define GC_USB_DOEPCTL15_STALL_MASK              0x200000
#define GC_USB_DOEPCTL15_STALL_SIZE              0x1
#define GC_USB_DOEPCTL15_STALL_DEFAULT           0x0
#define GC_USB_DOEPCTL15_STALL_OFFSET            0xce0
#define GC_USB_DOEPCTL15_CNAK_LSB                0x1a
#define GC_USB_DOEPCTL15_CNAK_MASK               0x4000000
#define GC_USB_DOEPCTL15_CNAK_SIZE               0x1
#define GC_USB_DOEPCTL15_CNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL15_CNAK_OFFSET             0xce0
#define GC_USB_DOEPCTL15_SNAK_LSB                0x1b
#define GC_USB_DOEPCTL15_SNAK_MASK               0x8000000
#define GC_USB_DOEPCTL15_SNAK_SIZE               0x1
#define GC_USB_DOEPCTL15_SNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL15_SNAK_OFFSET             0xce0
#define GC_USB_DOEPCTL15_SETD0PID_LSB            0x1c
#define GC_USB_DOEPCTL15_SETD0PID_MASK           0x10000000
#define GC_USB_DOEPCTL15_SETD0PID_SIZE           0x1
#define GC_USB_DOEPCTL15_SETD0PID_DEFAULT        0x0
#define GC_USB_DOEPCTL15_SETD0PID_OFFSET         0xce0
#define GC_USB_DOEPCTL15_SETD1PID_LSB            0x1d
#define GC_USB_DOEPCTL15_SETD1PID_MASK           0x20000000
#define GC_USB_DOEPCTL15_SETD1PID_SIZE           0x1
#define GC_USB_DOEPCTL15_SETD1PID_DEFAULT        0x0
#define GC_USB_DOEPCTL15_SETD1PID_OFFSET         0xce0
#define GC_USB_DOEPCTL15_EPDIS_LSB               0x1e
#define GC_USB_DOEPCTL15_EPDIS_MASK              0x40000000
#define GC_USB_DOEPCTL15_EPDIS_SIZE              0x1
#define GC_USB_DOEPCTL15_EPDIS_DEFAULT           0x0
#define GC_USB_DOEPCTL15_EPDIS_OFFSET            0xce0
#define GC_USB_DOEPCTL15_EPENA_LSB               0x1f
#define GC_USB_DOEPCTL15_EPENA_MASK              0x80000000
#define GC_USB_DOEPCTL15_EPENA_SIZE              0x1
#define GC_USB_DOEPCTL15_EPENA_DEFAULT           0x0
#define GC_USB_DOEPCTL15_EPENA_OFFSET            0xce0
#define GC_USB_DOEPINT15_XFERCOMPL_LSB           0x0
#define GC_USB_DOEPINT15_XFERCOMPL_MASK          0x1
#define GC_USB_DOEPINT15_XFERCOMPL_SIZE          0x1
#define GC_USB_DOEPINT15_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DOEPINT15_XFERCOMPL_OFFSET        0xce8
#define GC_USB_DOEPINT15_EPDISBLD_LSB            0x1
#define GC_USB_DOEPINT15_EPDISBLD_MASK           0x2
#define GC_USB_DOEPINT15_EPDISBLD_SIZE           0x1
#define GC_USB_DOEPINT15_EPDISBLD_DEFAULT        0x0
#define GC_USB_DOEPINT15_EPDISBLD_OFFSET         0xce8
#define GC_USB_DOEPINT15_AHBERR_LSB              0x2
#define GC_USB_DOEPINT15_AHBERR_MASK             0x4
#define GC_USB_DOEPINT15_AHBERR_SIZE             0x1
#define GC_USB_DOEPINT15_AHBERR_DEFAULT          0x0
#define GC_USB_DOEPINT15_AHBERR_OFFSET           0xce8
#define GC_USB_DOEPINT15_SETUP_LSB               0x3
#define GC_USB_DOEPINT15_SETUP_MASK              0x8
#define GC_USB_DOEPINT15_SETUP_SIZE              0x1
#define GC_USB_DOEPINT15_SETUP_DEFAULT           0x0
#define GC_USB_DOEPINT15_SETUP_OFFSET            0xce8
#define GC_USB_DOEPINT15_OUTTKNEPDIS_LSB         0x4
#define GC_USB_DOEPINT15_OUTTKNEPDIS_MASK        0x10
#define GC_USB_DOEPINT15_OUTTKNEPDIS_SIZE        0x1
#define GC_USB_DOEPINT15_OUTTKNEPDIS_DEFAULT     0x0
#define GC_USB_DOEPINT15_OUTTKNEPDIS_OFFSET      0xce8
#define GC_USB_DOEPINT15_STSPHSERCVD_LSB         0x5
#define GC_USB_DOEPINT15_STSPHSERCVD_MASK        0x20
#define GC_USB_DOEPINT15_STSPHSERCVD_SIZE        0x1
#define GC_USB_DOEPINT15_STSPHSERCVD_DEFAULT     0x0
#define GC_USB_DOEPINT15_STSPHSERCVD_OFFSET      0xce8
#define GC_USB_DOEPINT15_BACK2BACKSETUP_LSB      0x6
#define GC_USB_DOEPINT15_BACK2BACKSETUP_MASK     0x40
#define GC_USB_DOEPINT15_BACK2BACKSETUP_SIZE     0x1
#define GC_USB_DOEPINT15_BACK2BACKSETUP_DEFAULT  0x0
#define GC_USB_DOEPINT15_BACK2BACKSETUP_OFFSET   0xce8
#define GC_USB_DOEPINT15_OUTPKTERR_LSB           0x8
#define GC_USB_DOEPINT15_OUTPKTERR_MASK          0x100
#define GC_USB_DOEPINT15_OUTPKTERR_SIZE          0x1
#define GC_USB_DOEPINT15_OUTPKTERR_DEFAULT       0x0
#define GC_USB_DOEPINT15_OUTPKTERR_OFFSET        0xce8
#define GC_USB_DOEPINT15_BNAINTR_LSB             0x9
#define GC_USB_DOEPINT15_BNAINTR_MASK            0x200
#define GC_USB_DOEPINT15_BNAINTR_SIZE            0x1
#define GC_USB_DOEPINT15_BNAINTR_DEFAULT         0x0
#define GC_USB_DOEPINT15_BNAINTR_OFFSET          0xce8
#define GC_USB_DOEPINT15_PKTDRPSTS_LSB           0xb
#define GC_USB_DOEPINT15_PKTDRPSTS_MASK          0x800
#define GC_USB_DOEPINT15_PKTDRPSTS_SIZE          0x1
#define GC_USB_DOEPINT15_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DOEPINT15_PKTDRPSTS_OFFSET        0xce8
#define GC_USB_DOEPINT15_BBLEERR_LSB             0xc
#define GC_USB_DOEPINT15_BBLEERR_MASK            0x1000
#define GC_USB_DOEPINT15_BBLEERR_SIZE            0x1
#define GC_USB_DOEPINT15_BBLEERR_DEFAULT         0x0
#define GC_USB_DOEPINT15_BBLEERR_OFFSET          0xce8
#define GC_USB_DOEPINT15_NAKINTRPT_LSB           0xd
#define GC_USB_DOEPINT15_NAKINTRPT_MASK          0x2000
#define GC_USB_DOEPINT15_NAKINTRPT_SIZE          0x1
#define GC_USB_DOEPINT15_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT15_NAKINTRPT_OFFSET        0xce8
#define GC_USB_DOEPINT15_NYETINTRPT_LSB          0xe
#define GC_USB_DOEPINT15_NYETINTRPT_MASK         0x4000
#define GC_USB_DOEPINT15_NYETINTRPT_SIZE         0x1
#define GC_USB_DOEPINT15_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DOEPINT15_NYETINTRPT_OFFSET       0xce8
#define GC_USB_DOEPINT15_STUPPKTRCVD_LSB         0xf
#define GC_USB_DOEPINT15_STUPPKTRCVD_MASK        0x8000
#define GC_USB_DOEPINT15_STUPPKTRCVD_SIZE        0x1
#define GC_USB_DOEPINT15_STUPPKTRCVD_DEFAULT     0x0
#define GC_USB_DOEPINT15_STUPPKTRCVD_OFFSET      0xce8
#define GC_USB_DOEPTSIZ15_XFERSIZE_LSB           0x0
#define GC_USB_DOEPTSIZ15_XFERSIZE_MASK          0x7ffff
#define GC_USB_DOEPTSIZ15_XFERSIZE_SIZE          0x13
#define GC_USB_DOEPTSIZ15_XFERSIZE_DEFAULT       0x0
#define GC_USB_DOEPTSIZ15_XFERSIZE_OFFSET        0xcf0
#define GC_USB_DOEPTSIZ15_PKTCNT_LSB             0x13
#define GC_USB_DOEPTSIZ15_PKTCNT_MASK            0x1ff80000
#define GC_USB_DOEPTSIZ15_PKTCNT_SIZE            0xa
#define GC_USB_DOEPTSIZ15_PKTCNT_DEFAULT         0x0
#define GC_USB_DOEPTSIZ15_PKTCNT_OFFSET          0xcf0
#define GC_USB_DOEPTSIZ15_RXDPID_LSB             0x1d
#define GC_USB_DOEPTSIZ15_RXDPID_MASK            0x60000000
#define GC_USB_DOEPTSIZ15_RXDPID_SIZE            0x2
#define GC_USB_DOEPTSIZ15_RXDPID_DEFAULT         0x0
#define GC_USB_DOEPTSIZ15_RXDPID_OFFSET          0xcf0
#define GC_USB_DOEPDMA15_DMAADDR_LSB             0x0
#define GC_USB_DOEPDMA15_DMAADDR_MASK            0xffffffff
#define GC_USB_DOEPDMA15_DMAADDR_SIZE            0x20
#define GC_USB_DOEPDMA15_DMAADDR_DEFAULT         0x0
#define GC_USB_DOEPDMA15_DMAADDR_OFFSET          0xcf4
#define GC_USB_DOEPDMAB15_DMABUFFERADDR_LSB      0x0
#define GC_USB_DOEPDMAB15_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DOEPDMAB15_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DOEPDMAB15_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DOEPDMAB15_DMABUFFERADDR_OFFSET   0xcfc
#define GC_USB_PCGCCTL_STOPPCLK_LSB              0x0
#define GC_USB_PCGCCTL_STOPPCLK_MASK             0x1
#define GC_USB_PCGCCTL_STOPPCLK_SIZE             0x1
#define GC_USB_PCGCCTL_STOPPCLK_DEFAULT          0x0
#define GC_USB_PCGCCTL_STOPPCLK_OFFSET           0xe00
#define GC_USB_PCGCCTL_GATEHCLK_LSB              0x1
#define GC_USB_PCGCCTL_GATEHCLK_MASK             0x2
#define GC_USB_PCGCCTL_GATEHCLK_SIZE             0x1
#define GC_USB_PCGCCTL_GATEHCLK_DEFAULT          0x0
#define GC_USB_PCGCCTL_GATEHCLK_OFFSET           0xe00
#define GC_USB_PCGCCTL_PWRCLMP_LSB               0x2
#define GC_USB_PCGCCTL_PWRCLMP_MASK              0x4
#define GC_USB_PCGCCTL_PWRCLMP_SIZE              0x1
#define GC_USB_PCGCCTL_PWRCLMP_DEFAULT           0x0
#define GC_USB_PCGCCTL_PWRCLMP_OFFSET            0xe00
#define GC_USB_PCGCCTL_RSTPDWNMODULE_LSB         0x3
#define GC_USB_PCGCCTL_RSTPDWNMODULE_MASK        0x8
#define GC_USB_PCGCCTL_RSTPDWNMODULE_SIZE        0x1
#define GC_USB_PCGCCTL_RSTPDWNMODULE_DEFAULT     0x0
#define GC_USB_PCGCCTL_RSTPDWNMODULE_OFFSET      0xe00
#define GC_USB_PCGCCTL_PHYSLEEP_LSB              0x6
#define GC_USB_PCGCCTL_PHYSLEEP_MASK             0x40
#define GC_USB_PCGCCTL_PHYSLEEP_SIZE             0x1
#define GC_USB_PCGCCTL_PHYSLEEP_DEFAULT          0x0
#define GC_USB_PCGCCTL_PHYSLEEP_OFFSET           0xe00
#define GC_USB_PCGCCTL_L1SUSPENDED_LSB           0x7
#define GC_USB_PCGCCTL_L1SUSPENDED_MASK          0x80
#define GC_USB_PCGCCTL_L1SUSPENDED_SIZE          0x1
#define GC_USB_PCGCCTL_L1SUSPENDED_DEFAULT       0x0
#define GC_USB_PCGCCTL_L1SUSPENDED_OFFSET        0xe00
#define GC_USB_DFIFO_SIZE                        0x1000


#endif /* __CHIP_STM32_USB_DWC_REGISTERS_H */
